Ryan-Rogers/MMSoftware/MM_2015.X/support/dspic33e/h/p33EP32GS202.h
#define ADSTATL ADSTATL
extern volatile unsigned int  ADSTATL __attribute__((__sfr__));
typedef struct tagADSTATLBITS {
  unsigned AN0RDY:1;
  unsigned AN1RDY:1;
  unsigned AN2RDY:1;
  unsigned AN3RDY:1;
  unsigned AN4RDY:1;
  unsigned AN5RDY:1;
  unsigned AN6RDY:1;
  unsigned AN7RDY:1;
  unsigned AN8RDY:1;
  unsigned AN9RDY:1;
  unsigned AN10RDY:1;
  unsigned AN11RDY:1;
  unsigned AN12RDY:1;
  unsigned AN13RDY:1;
  unsigned AN14RDY:1;
} ADSTATLBITS;
extern volatile ADSTATLBITS ADSTATLbits __attribute__((__sfr__));

#define ADCMP0ENL ADCMP0ENL
extern volatile unsigned int  ADCMP0ENL __attribute__((__sfr__));
typedef struct tagADCMP0ENLBITS {
  unsigned CMPEN0:1;
  unsigned CMPEN1:1;
  unsigned CMPEN2:1;
  unsigned CMPEN3:1;
  unsigned CMPEN4:1;
  unsigned CMPEN5:1;
  unsigned CMPEN6:1;
  unsigned CMPEN7:1;
  unsigned CMPEN8:1;
  unsigned CMPEN9:1;
  unsigned CMPEN10:1;
  unsigned CMPEN11:1;
  unsigned CMPEN12:1;
  unsigned CMPEN13:1;
  unsigned CMPEN14:1;
} ADCMP0ENLBITS;
extern volatile ADCMP0ENLBITS ADCMP0ENLbits __attribute__((__sfr__));

#define ADCMP0LO ADCMP0LO
extern volatile unsigned int  ADCMP0LO __attribute__((__sfr__));
#define ADCMP0HI ADCMP0HI
extern volatile unsigned int  ADCMP0HI __attribute__((__sfr__));
#define ADCMP1ENL ADCMP1ENL
extern volatile unsigned int  ADCMP1ENL __attribute__((__sfr__));
typedef struct tagADCMP1ENLBITS {
  unsigned CMPEN0:1;
  unsigned CMPEN1:1;
  unsigned CMPEN2:1;
  unsigned CMPEN3:1;
  unsigned CMPEN4:1;
  unsigned CMPEN5:1;
  unsigned CMPEN6:1;
  unsigned CMPEN7:1;
  unsigned CMPEN8:1;
  unsigned CMPEN9:1;
  unsigned CMPEN10:1;
  unsigned CMPEN11:1;
  unsigned CMPEN12:1;
  unsigned CMPEN13:1;
  unsigned CMPEN14:1;
} ADCMP1ENLBITS;
extern volatile ADCMP1ENLBITS ADCMP1ENLbits __attribute__((__sfr__));

#define ADCMP1LO ADCMP1LO
extern volatile unsigned int  ADCMP1LO __attribute__((__sfr__));
#define ADCMP1HI ADCMP1HI
extern volatile unsigned int  ADCMP1HI __attribute__((__sfr__));
#define ADFL0DAT ADFL0DAT
extern volatile unsigned int  ADFL0DAT __attribute__((__sfr__));
#define ADFL0CON ADFL0CON
extern volatile unsigned int  ADFL0CON __attribute__((__sfr__));
__extension__ typedef struct tagADFL0CONBITS {
  union {
    struct {
      unsigned FLCHSEL:5;
      unsigned :3;
      unsigned RDY:1;
      unsigned CIE:1;
      unsigned OVRSAM:3;
      unsigned MODE:2;
      unsigned FLEN:1;
    };
    struct {
      unsigned FLCHSEL0:1;
      unsigned FLCHSEL1:1;
      unsigned FLCHSEL2:1;
      unsigned FLCHSEL3:1;
      unsigned FLCHSEL4:1;
      unsigned :5;
      unsigned OVRSAM0:1;
      unsigned OVRSAM1:1;
      unsigned OVRSAM2:1;
    };
  };
} ADFL0CONBITS;
extern volatile ADFL0CONBITS ADFL0CONbits __attribute__((__sfr__));

#define ADTRIG0L ADTRIG0L
extern volatile unsigned int  ADTRIG0L __attribute__((__sfr__));
__extension__ typedef struct tagADTRIG0LBITS {
  union {
    struct {
      unsigned TRGSRC0:5;
      unsigned :3;
      unsigned TRGSRC1:5;
    };
    struct {
      unsigned TRGSRC20:1;
      unsigned TRGSRC21:1;
      unsigned TRGSRC22:1;
      unsigned TRGSRC23:1;
      unsigned TRGSRC24:1;
      unsigned :3;
      unsigned TRGSRC10:1;
      unsigned TRGSRC11:1;
      unsigned TRGSRC12:1;
      unsigned TRGSRC13:1;
      unsigned TRGSRC14:1;
    };
  };
} ADTRIG0LBITS;
extern volatile ADTRIG0LBITS ADTRIG0Lbits __attribute__((__sfr__));

#define ADTRIG0H ADTRIG0H
extern volatile unsigned int  ADTRIG0H __attribute__((__sfr__));
__extension__ typedef struct tagADTRIG0HBITS {
  union {
    struct {
      unsigned TRGSRC2:5;
      unsigned :3;
      unsigned TRGSRC3:5;
    };
    struct {
      unsigned TRGSRC40:1;
      unsigned TRGSRC41:1;
      unsigned TRGSRC42:1;
      unsigned TRGSRC43:1;
      unsigned TRGSRC44:1;
      unsigned :3;
      unsigned TRGSRC30:1;
      unsigned TRGSRC31:1;
      unsigned TRGSRC32:1;
      unsigned TRGSRC33:1;
      unsigned TRGSRC34:1;
    };
  };
} ADTRIG0HBITS;
extern volatile ADTRIG0HBITS ADTRIG0Hbits __attribute__((__sfr__));

#define ADTRIG1L ADTRIG1L
extern volatile unsigned int  ADTRIG1L __attribute__((__sfr__));
__extension__ typedef struct tagADTRIG1LBITS {
  union {
    struct {
      unsigned TRGSRC4:5;
      unsigned :3;
      unsigned TRGSRC5:5;
    };
    struct {
      unsigned TRGSRC60:1;
      unsigned TRGSRC61:1;
      unsigned TRGSRC62:1;
      unsigned TRGSRC63:1;
      unsigned TRGSRC64:1;
      unsigned :3;
      unsigned TRGSRC50:1;
      unsigned TRGSRC51:1;
      unsigned TRGSRC52:1;
      unsigned TRGSRC53:1;
      unsigned TRGSRC54:1;
    };
  };
} ADTRIG1LBITS;
extern volatile ADTRIG1LBITS ADTRIG1Lbits __attribute__((__sfr__));

#define ADTRIG1H ADTRIG1H
extern volatile unsigned int  ADTRIG1H __attribute__((__sfr__));
__extension__ typedef struct tagADTRIG1HBITS {
  union {
    struct {
      unsigned TRGSRC6:5;
      unsigned :3;
      unsigned TRGSRC7:5;
    };
    struct {
      unsigned TRGSRC80:1;
      unsigned TRGSRC81:1;
      unsigned TRGSRC82:1;
      unsigned TRGSRC83:1;
      unsigned TRGSRC84:1;
      unsigned :3;
      unsigned TRGSRC70:1;
      unsigned TRGSRC71:1;
      unsigned TRGSRC72:1;
      unsigned TRGSRC73:1;
      unsigned TRGSRC74:1;
    };
  };
} ADTRIG1HBITS;
extern volatile ADTRIG1HBITS ADTRIG1Hbits __attribute__((__sfr__));

#define ADTRIG2L ADTRIG2L
extern volatile unsigned int  ADTRIG2L __attribute__((__sfr__));
__extension__ typedef struct tagADTRIG2LBITS {
  union {
    struct {
      unsigned TRGSRC8:5;
      unsigned :3;
      unsigned TRGSRC9:5;
    };
    struct {
      unsigned TRGSRC100:1;
      unsigned TRGSRC101:1;
      unsigned TRGSRC102:1;
      unsigned TRGSRC103:1;
      unsigned TRGSRC104:1;
      unsigned :3;
      unsigned TRGSRC90:1;
      unsigned TRGSRC91:1;
      unsigned TRGSRC92:1;
      unsigned TRGSRC93:1;
      unsigned TRGSRC94:1;
    };
  };
} ADTRIG2LBITS;
extern volatile ADTRIG2LBITS ADTRIG2Lbits __attribute__((__sfr__));

#define ADTRIG2H ADTRIG2H
extern volatile unsigned int  ADTRIG2H __attribute__((__sfr__));
__extension__ typedef struct tagADTRIG2HBITS {
  union {
    struct {
      unsigned TRGSRC10:5;
      unsigned :3;
      unsigned TRGSRC11:5;
    };
    struct {
      unsigned TRGSRC120:1;
      unsigned TRGSRC121:1;
      unsigned TRGSRC122:1;
      unsigned TRGSRC123:1;
      unsigned TRGSRC124:1;
      unsigned :3;
      unsigned TRGSRC110:1;
      unsigned TRGSRC111:1;
      unsigned TRGSRC112:1;
      unsigned TRGSRC113:1;
      unsigned TRGSRC114:1;
    };
  };
} ADTRIG2HBITS;
extern volatile ADTRIG2HBITS ADTRIG2Hbits __attribute__((__sfr__));

#define ADTRIG3L ADTRIG3L
extern volatile unsigned int  ADTRIG3L __attribute__((__sfr__));
__extension__ typedef struct tagADTRIG3LBITS {
  union {
    struct {
      unsigned TRGSRC12:5;
      unsigned :3;
      unsigned TRGSRC13:5;
    };
    struct {
      unsigned TRGSRC140:1;
      unsigned TRGSRC141:1;
      unsigned TRGSRC142:1;
      unsigned TRGSRC143:1;
      unsigned TRGSRC144:1;
      unsigned :3;
      unsigned TRGSRC130:1;
      unsigned TRGSRC131:1;
      unsigned TRGSRC132:1;
      unsigned TRGSRC133:1;
      unsigned TRGSRC134:1;
    };
  };
} ADTRIG3LBITS;
extern volatile ADTRIG3LBITS ADTRIG3Lbits __attribute__((__sfr__));

