Ryan-Rogers/MMSoftware/MM_2015.X/support/dspic33e/h/p33EP32GS202.h
#define ADTRIG3H ADTRIG3H
extern volatile unsigned int  ADTRIG3H __attribute__((__sfr__));
__extension__ typedef struct tagADTRIG3HBITS {
  union {
    struct {
      unsigned TRGSRC14:5;
    };
    struct {
      unsigned TRGSRC160:1;
      unsigned TRGSRC161:1;
      unsigned TRGSRC162:1;
      unsigned TRGSRC163:1;
      unsigned TRGSRC164:1;
    };
  };
} ADTRIG3HBITS;
extern volatile ADTRIG3HBITS ADTRIG3Hbits __attribute__((__sfr__));

#define ADCMP0CON ADCMP0CON
extern volatile unsigned int  ADCMP0CON __attribute__((__sfr__));
__extension__ typedef struct tagADCMP0CONBITS {
  union {
    struct {
      unsigned LOLO:1;
      unsigned LOHI:1;
      unsigned HILO:1;
      unsigned HIHI:1;
      unsigned BTWN:1;
      unsigned STAT:1;
      unsigned CIE:1;
      unsigned CMPEN:1;
      unsigned CHNL:5;
    };
    struct {
      unsigned :8;
      unsigned CHNL0:1;
      unsigned CHNL1:1;
      unsigned CHNL2:1;
      unsigned CHNL3:1;
      unsigned CHNL4:1;
    };
  };
} ADCMP0CONBITS;
extern volatile ADCMP0CONBITS ADCMP0CONbits __attribute__((__sfr__));

#define ADCMP1CON ADCMP1CON
extern volatile unsigned int  ADCMP1CON __attribute__((__sfr__));
__extension__ typedef struct tagADCMP1CONBITS {
  union {
    struct {
      unsigned LOLO:1;
      unsigned LOHI:1;
      unsigned HILO:1;
      unsigned HIHI:1;
      unsigned BTWN:1;
      unsigned STAT:1;
      unsigned CIE:1;
      unsigned CMPEN:1;
      unsigned CHNL:5;
    };
    struct {
      unsigned :8;
      unsigned CHNL0:1;
      unsigned CHNL1:1;
      unsigned CHNL2:1;
      unsigned CHNL3:1;
      unsigned CHNL4:1;
    };
  };
} ADCMP1CONBITS;
extern volatile ADCMP1CONBITS ADCMP1CONbits __attribute__((__sfr__));

#define ADBASE ADBASE
extern volatile unsigned int  ADBASE __attribute__((__sfr__));
__extension__ typedef struct tagADBASEBITS {
  union {
    struct {
      unsigned CHOFFSET:16;
    };
    struct {
      unsigned CHOFFSET0:1;
      unsigned CHOFFSET1:1;
      unsigned CHOFFSET2:1;
      unsigned CHOFFSET3:1;
      unsigned CHOFFSET4:1;
      unsigned CHOFFSET5:1;
      unsigned CHOFFSET6:1;
      unsigned CHOFFSET7:1;
      unsigned CHOFFSET8:1;
      unsigned CHOFFSET9:1;
      unsigned CHOFFSET10:1;
      unsigned CHOFFSET11:1;
      unsigned CHOFFSET12:1;
      unsigned CHOFFSET13:1;
      unsigned CHOFFSET14:1;
      unsigned CHOFFSET15:1;
    };
  };
} ADBASEBITS;
extern volatile ADBASEBITS ADBASEbits __attribute__((__sfr__));

#define ADLVLTRGL ADLVLTRGL
extern volatile unsigned int  ADLVLTRGL __attribute__((__sfr__));
typedef struct tagADLVLTRGLBITS {
  unsigned LVLEN0:1;
  unsigned LVLEN1:1;
  unsigned LVLEN2:1;
  unsigned LVLEN3:1;
  unsigned LVLEN4:1;
  unsigned LVLEN5:1;
  unsigned LVLEN6:1;
  unsigned LVLEN7:1;
  unsigned LVLEN8:1;
  unsigned LVLEN9:1;
  unsigned LVLEN10:1;
  unsigned LVLEN11:1;
  unsigned LVLEN12:1;
  unsigned LVLEN13:1;
  unsigned LVLEN14:1;
} ADLVLTRGLBITS;
extern volatile ADLVLTRGLBITS ADLVLTRGLbits __attribute__((__sfr__));

#define ADCORE0L ADCORE0L
extern volatile unsigned int  ADCORE0L __attribute__((__sfr__));
__extension__ typedef struct tagADCORE0LBITS {
  union {
    struct {
      unsigned SAMC:10;
    };
    struct {
      unsigned SAMC0:1;
      unsigned SAMC1:1;
      unsigned SAMC2:1;
      unsigned SAMC3:1;
      unsigned SAMC4:1;
      unsigned SAMC5:1;
      unsigned SAMC6:1;
      unsigned SAMC7:1;
      unsigned SAMC8:1;
      unsigned SAMC9:1;
    };
  };
} ADCORE0LBITS;
extern volatile ADCORE0LBITS ADCORE0Lbits __attribute__((__sfr__));

#define ADCORE0H ADCORE0H
extern volatile unsigned int  ADCORE0H __attribute__((__sfr__));
__extension__ typedef struct tagADCORE0HBITS {
  union {
    struct {
      unsigned ADCS:7;
      unsigned :1;
      unsigned RES:2;
      unsigned EISEL:3;
    };
    struct {
      unsigned ADCS0:1;
      unsigned ADCS1:1;
      unsigned ADCS2:1;
      unsigned ADCS3:1;
      unsigned ADCS4:1;
      unsigned ADCS5:1;
      unsigned ADCS6:1;
      unsigned :1;
      unsigned RES0:1;
      unsigned RES1:1;
      unsigned EISEL0:1;
      unsigned EISEL1:1;
      unsigned EISEL2:1;
    };
  };
} ADCORE0HBITS;
extern volatile ADCORE0HBITS ADCORE0Hbits __attribute__((__sfr__));

#define ADCORE1L ADCORE1L
extern volatile unsigned int  ADCORE1L __attribute__((__sfr__));
__extension__ typedef struct tagADCORE1LBITS {
  union {
    struct {
      unsigned SAMC:10;
    };
    struct {
      unsigned SAMC0:1;
      unsigned SAMC1:1;
      unsigned SAMC2:1;
      unsigned SAMC3:1;
      unsigned SAMC4:1;
      unsigned SAMC5:1;
      unsigned SAMC6:1;
      unsigned SAMC7:1;
      unsigned SAMC8:1;
      unsigned SAMC9:1;
    };
  };
} ADCORE1LBITS;
extern volatile ADCORE1LBITS ADCORE1Lbits __attribute__((__sfr__));

#define ADCORE1H ADCORE1H
extern volatile unsigned int  ADCORE1H __attribute__((__sfr__));
__extension__ typedef struct tagADCORE1HBITS {
  union {
    struct {
      unsigned ADCS:7;
      unsigned :1;
      unsigned RES:2;
      unsigned EISEL:3;
    };
    struct {
      unsigned ADCS0:1;
      unsigned ADCS1:1;
      unsigned ADCS2:1;
      unsigned ADCS3:1;
      unsigned ADCS4:1;
      unsigned ADCS5:1;
      unsigned ADCS6:1;
      unsigned :1;
      unsigned RES0:1;
      unsigned RES1:1;
      unsigned EISEL0:1;
      unsigned EISEL1:1;
      unsigned EISEL2:1;
    };
  };
} ADCORE1HBITS;
extern volatile ADCORE1HBITS ADCORE1Hbits __attribute__((__sfr__));

#define ADEICONL ADEICONL
extern volatile unsigned int  ADEICONL __attribute__((__sfr__));
typedef struct tagADEICONLBITS {
  unsigned C0EIF:1;
  unsigned C1EIF:1;
  unsigned :5;
  unsigned SHREIF:1;
  unsigned C0EIEN:1;
  unsigned C1EIEN:1;
  unsigned :5;
  unsigned SHREIEN:1;
} ADEICONLBITS;
extern volatile ADEICONLBITS ADEICONLbits __attribute__((__sfr__));

#define ADEICONH ADEICONH
extern volatile unsigned int  ADEICONH __attribute__((__sfr__));
typedef struct tagADEICONHBITS {
  unsigned SHREICH:6;
} ADEICONHBITS;
extern volatile ADEICONHBITS ADEICONHbits __attribute__((__sfr__));

#define ADCON5L ADCON5L
extern volatile unsigned int  ADCON5L __attribute__((__sfr__));
typedef struct tagADCON5LBITS {
  unsigned C0PWR:1;
  unsigned C1PWR:1;
  unsigned :5;
  unsigned SHRPWR:1;
  unsigned C0RDY:1;
  unsigned C1RDY:1;
  unsigned :5;
  unsigned SHRRDY:1;
} ADCON5LBITS;
