Ryan-Rogers/MMSoftware/MM_2015.X/support/dspic33e/h/p33EP32GS202.h
/* I2C1CON1 */
#define _SEN I2C1CON1bits.SEN
#define _RSEN I2C1CON1bits.RSEN
#define _PEN I2C1CON1bits.PEN
#define _RCEN I2C1CON1bits.RCEN
#define _ACKEN I2C1CON1bits.ACKEN
#define _ACKDT I2C1CON1bits.ACKDT
#define _STREN I2C1CON1bits.STREN
#define _GCEN I2C1CON1bits.GCEN
#define _SMEN I2C1CON1bits.SMEN
#define _DISSLW I2C1CON1bits.DISSLW
#define _A10M I2C1CON1bits.A10M
#define _STRICT I2C1CON1bits.STRICT
#define _SCLREL I2C1CON1bits.SCLREL
#define _I2CSIDL I2C1CON1bits.I2CSIDL
#define _I2CEN I2C1CON1bits.I2CEN

/* I2C1CON2 */
#define _DHEN I2C1CON2bits.DHEN
#define _AHEN I2C1CON2bits.AHEN
#define _SBCDE I2C1CON2bits.SBCDE
#define _SDAHT I2C1CON2bits.SDAHT
#define _BOEN I2C1CON2bits.BOEN
#define _SCIE I2C1CON2bits.SCIE
#define _PCIE I2C1CON2bits.PCIE

/* I2C1STAT */
#define _TBF I2C1STATbits.TBF
#define _RBF I2C1STATbits.RBF
#define _R_W I2C1STATbits.R_W
#define _S I2C1STATbits.S
#define _P I2C1STATbits.P
#define _D_A I2C1STATbits.D_A
#define _I2COV I2C1STATbits.I2COV
#define _IWCOL I2C1STATbits.IWCOL
#define _ADD10 I2C1STATbits.ADD10
#define _GCSTAT I2C1STATbits.GCSTAT
/* Bitname _BCL cannot be defined because it is used by more than one SFR */
#define _ACKTIM I2C1STATbits.ACKTIM
#define _TRSTAT I2C1STATbits.TRSTAT
#define _ACKSTAT I2C1STATbits.ACKSTAT

/* I2C1ADD */
#define _ADD I2C1ADDbits.ADD

/* I2C1MSK */
#define _AMSK I2C1MSKbits.AMSK
#define _AMSK0 I2C1MSKbits.AMSK0
#define _AMSK1 I2C1MSKbits.AMSK1
#define _AMSK2 I2C1MSKbits.AMSK2
#define _AMSK3 I2C1MSKbits.AMSK3
#define _AMSK4 I2C1MSKbits.AMSK4
#define _AMSK5 I2C1MSKbits.AMSK5
#define _AMSK6 I2C1MSKbits.AMSK6
#define _AMSK7 I2C1MSKbits.AMSK7
#define _AMSK8 I2C1MSKbits.AMSK8
#define _AMSK9 I2C1MSKbits.AMSK9

/* I2C1TRN */
#define _I2CTXDATA I2C1TRNbits.I2CTXDATA

/* I2C1RCV */
#define _I2CRXDATA I2C1RCVbits.I2CRXDATA

/* U1MODE */
#define _STSEL U1MODEbits.STSEL
#define _PDSEL U1MODEbits.PDSEL
#define _BRGH U1MODEbits.BRGH
#define _URXINV U1MODEbits.URXINV
#define _ABAUD U1MODEbits.ABAUD
#define _LPBACK U1MODEbits.LPBACK
#define _WAKE U1MODEbits.WAKE
#define _UEN U1MODEbits.UEN
#define _RTSMD U1MODEbits.RTSMD
#define _IREN U1MODEbits.IREN
#define _USIDL U1MODEbits.USIDL
#define _UARTEN U1MODEbits.UARTEN
#define _PDSEL0 U1MODEbits.PDSEL0
#define _PDSEL1 U1MODEbits.PDSEL1
#define _RXINV U1MODEbits.RXINV
#define _UEN0 U1MODEbits.UEN0
#define _UEN1 U1MODEbits.UEN1

/* U1STA */
#define _URXDA U1STAbits.URXDA
#define _OERR U1STAbits.OERR
#define _FERR U1STAbits.FERR
#define _PERR U1STAbits.PERR
#define _RIDLE U1STAbits.RIDLE
#define _ADDEN U1STAbits.ADDEN
#define _URXISEL U1STAbits.URXISEL
#define _TRMT U1STAbits.TRMT
#define _UTXBF U1STAbits.UTXBF
#define _UTXEN U1STAbits.UTXEN
#define _UTXBRK U1STAbits.UTXBRK
#define _UTXISEL0 U1STAbits.UTXISEL0
#define _UTXINV U1STAbits.UTXINV
#define _UTXISEL1 U1STAbits.UTXISEL1
#define _URXISEL0 U1STAbits.URXISEL0
#define _URXISEL1 U1STAbits.URXISEL1
#define _TXINV U1STAbits.TXINV

/* SPI1STAT */
#define _SPIRBF SPI1STATbits.SPIRBF
#define _SPITBF SPI1STATbits.SPITBF
#define _SISEL SPI1STATbits.SISEL
#define _SRXMPT SPI1STATbits.SRXMPT
#define _SPIROV SPI1STATbits.SPIROV
#define _SRMPT SPI1STATbits.SRMPT
#define _SPIBEC SPI1STATbits.SPIBEC
#define _SPISIDL SPI1STATbits.SPISIDL
#define _SPIEN SPI1STATbits.SPIEN
#define _SISEL0 SPI1STATbits.SISEL0
#define _SISEL1 SPI1STATbits.SISEL1
#define _SISEL2 SPI1STATbits.SISEL2
#define _SPIBEC0 SPI1STATbits.SPIBEC0
#define _SPIBEC1 SPI1STATbits.SPIBEC1
#define _SPIBEC2 SPI1STATbits.SPIBEC2

/* SPI1CON1 */
#define _PPRE SPI1CON1bits.PPRE
#define _SPRE SPI1CON1bits.SPRE
#define _MSTEN SPI1CON1bits.MSTEN
#define _CKP SPI1CON1bits.CKP
#define _SSEN SPI1CON1bits.SSEN
#define _CKE SPI1CON1bits.CKE
#define _SMP SPI1CON1bits.SMP
#define _MODE16 SPI1CON1bits.MODE16
#define _DISSDO SPI1CON1bits.DISSDO
#define _DISSCK SPI1CON1bits.DISSCK
#define _PPRE0 SPI1CON1bits.PPRE0
#define _PPRE1 SPI1CON1bits.PPRE1
#define _SPRE0 SPI1CON1bits.SPRE0
#define _SPRE1 SPI1CON1bits.SPRE1
#define _SPRE2 SPI1CON1bits.SPRE2

/* SPI1CON2 */
#define _SPIBEN SPI1CON2bits.SPIBEN
#define _SPIFE SPI1CON2bits.SPIFE
#define _SPIFPOL SPI1CON2bits.SPIFPOL
#define _SPIFSD SPI1CON2bits.SPIFSD
#define _FRMEN SPI1CON2bits.FRMEN
#define _FRMDLY SPI1CON2bits.FRMDLY
#define _FRMPOL SPI1CON2bits.FRMPOL

/* ADCON1L */
#define _BSHFT ADCON1Lbits.BSHFT
#define _PUMPEN ADCON1Lbits.PUMPEN
#define _ADSIDL ADCON1Lbits.ADSIDL
#define _ADON ADCON1Lbits.ADON
#define _BSHFT0 ADCON1Lbits.BSHFT0
#define _BSHFT1 ADCON1Lbits.BSHFT1
#define _BSHFT2 ADCON1Lbits.BSHFT2

/* ADCON1H */
#define _SHRRES ADCON1Hbits.SHRRES
#define _FORM ADCON1Hbits.FORM
#define _TRBSLV ADCON1Hbits.TRBSLV
#define _TRBMST ADCON1Hbits.TRBMST
#define _TRBERR ADCON1Hbits.TRBERR
#define _TRBEN ADCON1Hbits.TRBEN
#define _SHRRES0 ADCON1Hbits.SHRRES0
#define _SHRRES1 ADCON1Hbits.SHRRES1
#define _TRBSLV0 ADCON1Hbits.TRBSLV0
#define _TRBSLV1 ADCON1Hbits.TRBSLV1
#define _TRBSLV2 ADCON1Hbits.TRBSLV2
#define _TRBMST0 ADCON1Hbits.TRBMST0
#define _TRBMST1 ADCON1Hbits.TRBMST1
#define _TRBMST2 ADCON1Hbits.TRBMST2

/* ADCON2L */
#define _SHRADCS ADCON2Lbits.SHRADCS
#define _SHREISEL ADCON2Lbits.SHREISEL
#define _REFERCIE ADCON2Lbits.REFERCIE
#define _REFCIE ADCON2Lbits.REFCIE
#define _SHRADCS0 ADCON2Lbits.SHRADCS0
#define _SHRADCS1 ADCON2Lbits.SHRADCS1
#define _SHRADCS2 ADCON2Lbits.SHRADCS2
#define _SHRADCS3 ADCON2Lbits.SHRADCS3
#define _SHRADCS4 ADCON2Lbits.SHRADCS4
#define _SHRADCS5 ADCON2Lbits.SHRADCS5
#define _SHRADCS6 ADCON2Lbits.SHRADCS6
#define _SHREISEL0 ADCON2Lbits.SHREISEL0
#define _SHREISEL1 ADCON2Lbits.SHREISEL1
#define _SHREISEL2 ADCON2Lbits.SHREISEL2

/* ADCON2H */
#define _SHRSAMC ADCON2Hbits.SHRSAMC
#define _REFERR ADCON2Hbits.REFERR
#define _REFRDY ADCON2Hbits.REFRDY
#define _SHRSAMC0 ADCON2Hbits.SHRSAMC0
#define _SHRSAMC1 ADCON2Hbits.SHRSAMC1
#define _SHRSAMC2 ADCON2Hbits.SHRSAMC2
#define _SHRSAMC3 ADCON2Hbits.SHRSAMC3
#define _SHRSAMC4 ADCON2Hbits.SHRSAMC4
#define _SHRSAMC5 ADCON2Hbits.SHRSAMC5
#define _SHRSAMC6 ADCON2Hbits.SHRSAMC6
#define _SHRSAMC7 ADCON2Hbits.SHRSAMC7
#define _SHRSAMC8 ADCON2Hbits.SHRSAMC8
#define _SHRSAMC9 ADCON2Hbits.SHRSAMC9

/* ADCON3L */
#define _CNVCHSEL ADCON3Lbits.CNVCHSEL
#define _SWCTRG ADCON3Lbits.SWCTRG
#define _SWLCTRG ADCON3Lbits.SWLCTRG
#define _CNVRTCH ADCON3Lbits.CNVRTCH
#define _SHRSAMP ADCON3Lbits.SHRSAMP
#define _SUSPRDY ADCON3Lbits.SUSPRDY
#define _SUSPCIE ADCON3Lbits.SUSPCIE
#define _SUSPEND ADCON3Lbits.SUSPEND
#define _REFSEL ADCON3Lbits.REFSEL
#define _CNVCHSEL0 ADCON3Lbits.CNVCHSEL0
#define _CNVCHSEL1 ADCON3Lbits.CNVCHSEL1
#define _CNVCHSEL2 ADCON3Lbits.CNVCHSEL2
#define _CNVCHSEL3 ADCON3Lbits.CNVCHSEL3
#define _CNVCHSEL4 ADCON3Lbits.CNVCHSEL4
#define _CNVCHSEL5 ADCON3Lbits.CNVCHSEL5
#define _REFSEL0 ADCON3Lbits.REFSEL0
#define _REFSEL1 ADCON3Lbits.REFSEL1
#define _REFSEL2 ADCON3Lbits.REFSEL2

/* ADCON3H */
#define _C0EN ADCON3Hbits.C0EN
#define _C1EN ADCON3Hbits.C1EN
#define _SHREN ADCON3Hbits.SHREN
#define _CLKDIV ADCON3Hbits.CLKDIV
#define _CLKSEL ADCON3Hbits.CLKSEL
#define _CLKDIV0 ADCON3Hbits.CLKDIV0
#define _CLKDIV1 ADCON3Hbits.CLKDIV1
#define _CLKDIV2 ADCON3Hbits.CLKDIV2
#define _CLKDIV3 ADCON3Hbits.CLKDIV3
#define _CLKDIV4 ADCON3Hbits.CLKDIV4
#define _CLKDIV5 ADCON3Hbits.CLKDIV5
#define _CLKSEL0 ADCON3Hbits.CLKSEL0
#define _CLKSEL1 ADCON3Hbits.CLKSEL1

/* ADCON4L */
#define _SAMC0EN ADCON4Lbits.SAMC0EN
#define _SAMC1EN ADCON4Lbits.SAMC1EN
#define _SYNCTRG0 ADCON4Lbits.SYNCTRG0
#define _SYNCTRG1 ADCON4Lbits.SYNCTRG1

/* ADCON4H */
#define _C0CHS ADCON4Hbits.C0CHS
#define _C1CHS ADCON4Hbits.C1CHS
#define _C0CHS0 ADCON4Hbits.C0CHS0
#define _C0CHS1 ADCON4Hbits.C0CHS1
#define _C1CHS0 ADCON4Hbits.C1CHS0
#define _C1CHS1 ADCON4Hbits.C1CHS1

/* ADMOD0L */
#define _SIGN0 ADMOD0Lbits.SIGN0
#define _DIFF0 ADMOD0Lbits.DIFF0
#define _SIGN1 ADMOD0Lbits.SIGN1
#define _DIFF1 ADMOD0Lbits.DIFF1
#define _SIGN2 ADMOD0Lbits.SIGN2
#define _DIFF2 ADMOD0Lbits.DIFF2
#define _SIGN3 ADMOD0Lbits.SIGN3
#define _DIFF3 ADMOD0Lbits.DIFF3
#define _SIGN4 ADMOD0Lbits.SIGN4
#define _DIFF4 ADMOD0Lbits.DIFF4
#define _SIGN5 ADMOD0Lbits.SIGN5
#define _DIFF5 ADMOD0Lbits.DIFF5
#define _SIGN6 ADMOD0Lbits.SIGN6
#define _DIFF6 ADMOD0Lbits.DIFF6
#define _SIGN7 ADMOD0Lbits.SIGN7
#define _DIFF7 ADMOD0Lbits.DIFF7

/* ADMOD0H */
#define _SIGN8 ADMOD0Hbits.SIGN8
#define _DIFF8 ADMOD0Hbits.DIFF8
#define _SIGN9 ADMOD0Hbits.SIGN9
#define _DIFF9 ADMOD0Hbits.DIFF9
#define _SIGN10 ADMOD0Hbits.SIGN10
#define _DIFF10 ADMOD0Hbits.DIFF10
#define _SIGN11 ADMOD0Hbits.SIGN11
#define _DIFF11 ADMOD0Hbits.DIFF11
#define _SIGN12 ADMOD0Hbits.SIGN12
#define _DIFF12 ADMOD0Hbits.DIFF12
#define _SIGN13 ADMOD0Hbits.SIGN13
#define _DIFF13 ADMOD0Hbits.DIFF13
#define _SIGN14 ADMOD0Hbits.SIGN14
#define _DIFF14 ADMOD0Hbits.DIFF14

