Ryan-Rogers/MMSoftware/MM_2015.X/support/dspic33e/h/p33EP32GS202.h
/* ADCIE1L */
#define _CIE0 ADCIE1Lbits.CIE0
#define _CIE1 ADCIE1Lbits.CIE1
#define _CIE2 ADCIE1Lbits.CIE2
#define _CIE3 ADCIE1Lbits.CIE3
#define _CIE4 ADCIE1Lbits.CIE4
#define _CIE5 ADCIE1Lbits.CIE5
#define _CIE6 ADCIE1Lbits.CIE6
#define _CIE7 ADCIE1Lbits.CIE7
#define _CIE8 ADCIE1Lbits.CIE8
#define _CIE9 ADCIE1Lbits.CIE9
#define _CIE10 ADCIE1Lbits.CIE10
#define _CIE11 ADCIE1Lbits.CIE11
#define _CIE12 ADCIE1Lbits.CIE12
#define _CIE13 ADCIE1Lbits.CIE13
#define _CIE14 ADCIE1Lbits.CIE14

/* ADCSS1L */
#define _CSS0 ADCSS1Lbits.CSS0
#define _CSS1 ADCSS1Lbits.CSS1
#define _CSS2 ADCSS1Lbits.CSS2
#define _CSS3 ADCSS1Lbits.CSS3
#define _CSS4 ADCSS1Lbits.CSS4
#define _CSS5 ADCSS1Lbits.CSS5
#define _CSS6 ADCSS1Lbits.CSS6
#define _CSS7 ADCSS1Lbits.CSS7
#define _CSS8 ADCSS1Lbits.CSS8
#define _CSS9 ADCSS1Lbits.CSS9
#define _CSS10 ADCSS1Lbits.CSS10
#define _CSS11 ADCSS1Lbits.CSS11
#define _CSS12 ADCSS1Lbits.CSS12
#define _CSS13 ADCSS1Lbits.CSS13
#define _CSS14 ADCSS1Lbits.CSS14

/* ADSTATL */
#define _AN0RDY ADSTATLbits.AN0RDY
#define _AN1RDY ADSTATLbits.AN1RDY
#define _AN2RDY ADSTATLbits.AN2RDY
#define _AN3RDY ADSTATLbits.AN3RDY
#define _AN4RDY ADSTATLbits.AN4RDY
#define _AN5RDY ADSTATLbits.AN5RDY
#define _AN6RDY ADSTATLbits.AN6RDY
#define _AN7RDY ADSTATLbits.AN7RDY
#define _AN8RDY ADSTATLbits.AN8RDY
#define _AN9RDY ADSTATLbits.AN9RDY
#define _AN10RDY ADSTATLbits.AN10RDY
#define _AN11RDY ADSTATLbits.AN11RDY
#define _AN12RDY ADSTATLbits.AN12RDY
#define _AN13RDY ADSTATLbits.AN13RDY
#define _AN14RDY ADSTATLbits.AN14RDY

/* ADCMP0ENL */
/* Bitname _CMPEN0 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN1 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN2 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN3 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN4 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN5 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN6 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN7 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN8 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN9 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN10 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN11 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN12 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN13 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN14 cannot be defined because it is used by more than one SFR */

/* ADCMP1ENL */
/* Bitname _CMPEN0 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN1 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN2 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN3 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN4 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN5 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN6 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN7 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN8 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN9 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN10 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN11 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN12 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN13 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN14 cannot be defined because it is used by more than one SFR */

/* ADFL0CON */
#define _FLCHSEL ADFL0CONbits.FLCHSEL
#define _RDY ADFL0CONbits.RDY
/* Bitname _CIE cannot be defined because it is used by more than one SFR */
#define _OVRSAM ADFL0CONbits.OVRSAM
#define _MODE ADFL0CONbits.MODE
#define _FLEN ADFL0CONbits.FLEN
#define _FLCHSEL0 ADFL0CONbits.FLCHSEL0
#define _FLCHSEL1 ADFL0CONbits.FLCHSEL1
#define _FLCHSEL2 ADFL0CONbits.FLCHSEL2
#define _FLCHSEL3 ADFL0CONbits.FLCHSEL3
#define _FLCHSEL4 ADFL0CONbits.FLCHSEL4
#define _OVRSAM0 ADFL0CONbits.OVRSAM0
#define _OVRSAM1 ADFL0CONbits.OVRSAM1
#define _OVRSAM2 ADFL0CONbits.OVRSAM2

/* ADTRIG0L */
#define _TRGSRC0 ADTRIG0Lbits.TRGSRC0
#define _TRGSRC1 ADTRIG0Lbits.TRGSRC1
#define _TRGSRC20 ADTRIG0Lbits.TRGSRC20
#define _TRGSRC21 ADTRIG0Lbits.TRGSRC21
#define _TRGSRC22 ADTRIG0Lbits.TRGSRC22
#define _TRGSRC23 ADTRIG0Lbits.TRGSRC23
#define _TRGSRC24 ADTRIG0Lbits.TRGSRC24
/* Bitname _TRGSRC10 cannot be defined because it is used by more than one SFR */
/* Bitname _TRGSRC11 cannot be defined because it is used by more than one SFR */
/* Bitname _TRGSRC12 cannot be defined because it is used by more than one SFR */
/* Bitname _TRGSRC13 cannot be defined because it is used by more than one SFR */
/* Bitname _TRGSRC14 cannot be defined because it is used by more than one SFR */

/* ADTRIG0H */
#define _TRGSRC2 ADTRIG0Hbits.TRGSRC2
#define _TRGSRC3 ADTRIG0Hbits.TRGSRC3
#define _TRGSRC40 ADTRIG0Hbits.TRGSRC40
#define _TRGSRC41 ADTRIG0Hbits.TRGSRC41
#define _TRGSRC42 ADTRIG0Hbits.TRGSRC42
#define _TRGSRC43 ADTRIG0Hbits.TRGSRC43
#define _TRGSRC44 ADTRIG0Hbits.TRGSRC44
#define _TRGSRC30 ADTRIG0Hbits.TRGSRC30
#define _TRGSRC31 ADTRIG0Hbits.TRGSRC31
#define _TRGSRC32 ADTRIG0Hbits.TRGSRC32
#define _TRGSRC33 ADTRIG0Hbits.TRGSRC33
#define _TRGSRC34 ADTRIG0Hbits.TRGSRC34

/* ADTRIG1L */
#define _TRGSRC4 ADTRIG1Lbits.TRGSRC4
#define _TRGSRC5 ADTRIG1Lbits.TRGSRC5
#define _TRGSRC60 ADTRIG1Lbits.TRGSRC60
#define _TRGSRC61 ADTRIG1Lbits.TRGSRC61
#define _TRGSRC62 ADTRIG1Lbits.TRGSRC62
#define _TRGSRC63 ADTRIG1Lbits.TRGSRC63
#define _TRGSRC64 ADTRIG1Lbits.TRGSRC64
#define _TRGSRC50 ADTRIG1Lbits.TRGSRC50
#define _TRGSRC51 ADTRIG1Lbits.TRGSRC51
#define _TRGSRC52 ADTRIG1Lbits.TRGSRC52
#define _TRGSRC53 ADTRIG1Lbits.TRGSRC53
#define _TRGSRC54 ADTRIG1Lbits.TRGSRC54

/* ADTRIG1H */
#define _TRGSRC6 ADTRIG1Hbits.TRGSRC6
#define _TRGSRC7 ADTRIG1Hbits.TRGSRC7
#define _TRGSRC80 ADTRIG1Hbits.TRGSRC80
#define _TRGSRC81 ADTRIG1Hbits.TRGSRC81
#define _TRGSRC82 ADTRIG1Hbits.TRGSRC82
#define _TRGSRC83 ADTRIG1Hbits.TRGSRC83
#define _TRGSRC84 ADTRIG1Hbits.TRGSRC84
#define _TRGSRC70 ADTRIG1Hbits.TRGSRC70
#define _TRGSRC71 ADTRIG1Hbits.TRGSRC71
#define _TRGSRC72 ADTRIG1Hbits.TRGSRC72
#define _TRGSRC73 ADTRIG1Hbits.TRGSRC73
#define _TRGSRC74 ADTRIG1Hbits.TRGSRC74

/* ADTRIG2L */
#define _TRGSRC8 ADTRIG2Lbits.TRGSRC8
#define _TRGSRC9 ADTRIG2Lbits.TRGSRC9
#define _TRGSRC100 ADTRIG2Lbits.TRGSRC100
#define _TRGSRC101 ADTRIG2Lbits.TRGSRC101
#define _TRGSRC102 ADTRIG2Lbits.TRGSRC102
#define _TRGSRC103 ADTRIG2Lbits.TRGSRC103
#define _TRGSRC104 ADTRIG2Lbits.TRGSRC104
#define _TRGSRC90 ADTRIG2Lbits.TRGSRC90
#define _TRGSRC91 ADTRIG2Lbits.TRGSRC91
#define _TRGSRC92 ADTRIG2Lbits.TRGSRC92
#define _TRGSRC93 ADTRIG2Lbits.TRGSRC93
#define _TRGSRC94 ADTRIG2Lbits.TRGSRC94

/* ADTRIG2H */
/* Bitname _TRGSRC10 cannot be defined because it is used by more than one SFR */
/* Bitname _TRGSRC11 cannot be defined because it is used by more than one SFR */
#define _TRGSRC120 ADTRIG2Hbits.TRGSRC120
#define _TRGSRC121 ADTRIG2Hbits.TRGSRC121
#define _TRGSRC122 ADTRIG2Hbits.TRGSRC122
#define _TRGSRC123 ADTRIG2Hbits.TRGSRC123
#define _TRGSRC124 ADTRIG2Hbits.TRGSRC124
#define _TRGSRC110 ADTRIG2Hbits.TRGSRC110
#define _TRGSRC111 ADTRIG2Hbits.TRGSRC111
#define _TRGSRC112 ADTRIG2Hbits.TRGSRC112
#define _TRGSRC113 ADTRIG2Hbits.TRGSRC113
#define _TRGSRC114 ADTRIG2Hbits.TRGSRC114

/* ADTRIG3L */
/* Bitname _TRGSRC12 cannot be defined because it is used by more than one SFR */
/* Bitname _TRGSRC13 cannot be defined because it is used by more than one SFR */
#define _TRGSRC140 ADTRIG3Lbits.TRGSRC140
#define _TRGSRC141 ADTRIG3Lbits.TRGSRC141
#define _TRGSRC142 ADTRIG3Lbits.TRGSRC142
#define _TRGSRC143 ADTRIG3Lbits.TRGSRC143
#define _TRGSRC144 ADTRIG3Lbits.TRGSRC144
#define _TRGSRC130 ADTRIG3Lbits.TRGSRC130
#define _TRGSRC131 ADTRIG3Lbits.TRGSRC131
#define _TRGSRC132 ADTRIG3Lbits.TRGSRC132
#define _TRGSRC133 ADTRIG3Lbits.TRGSRC133
#define _TRGSRC134 ADTRIG3Lbits.TRGSRC134

/* ADTRIG3H */
/* Bitname _TRGSRC14 cannot be defined because it is used by more than one SFR */
#define _TRGSRC160 ADTRIG3Hbits.TRGSRC160
#define _TRGSRC161 ADTRIG3Hbits.TRGSRC161
#define _TRGSRC162 ADTRIG3Hbits.TRGSRC162
#define _TRGSRC163 ADTRIG3Hbits.TRGSRC163
#define _TRGSRC164 ADTRIG3Hbits.TRGSRC164

/* ADCMP0CON */
/* Bitname _LOLO cannot be defined because it is used by more than one SFR */
/* Bitname _LOHI cannot be defined because it is used by more than one SFR */
/* Bitname _HILO cannot be defined because it is used by more than one SFR */
/* Bitname _HIHI cannot be defined because it is used by more than one SFR */
/* Bitname _BTWN cannot be defined because it is used by more than one SFR */
/* Bitname _STAT cannot be defined because it is used by more than one SFR */
/* Bitname _CIE cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN cannot be defined because it is used by more than one SFR */
/* Bitname _CHNL cannot be defined because it is used by more than one SFR */
/* Bitname _CHNL0 cannot be defined because it is used by more than one SFR */
/* Bitname _CHNL1 cannot be defined because it is used by more than one SFR */
/* Bitname _CHNL2 cannot be defined because it is used by more than one SFR */
/* Bitname _CHNL3 cannot be defined because it is used by more than one SFR */
/* Bitname _CHNL4 cannot be defined because it is used by more than one SFR */

/* ADCMP1CON */
/* Bitname _LOLO cannot be defined because it is used by more than one SFR */
/* Bitname _LOHI cannot be defined because it is used by more than one SFR */
/* Bitname _HILO cannot be defined because it is used by more than one SFR */
/* Bitname _HIHI cannot be defined because it is used by more than one SFR */
/* Bitname _BTWN cannot be defined because it is used by more than one SFR */
/* Bitname _STAT cannot be defined because it is used by more than one SFR */
/* Bitname _CIE cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN cannot be defined because it is used by more than one SFR */
/* Bitname _CHNL cannot be defined because it is used by more than one SFR */
/* Bitname _CHNL0 cannot be defined because it is used by more than one SFR */
/* Bitname _CHNL1 cannot be defined because it is used by more than one SFR */
/* Bitname _CHNL2 cannot be defined because it is used by more than one SFR */
/* Bitname _CHNL3 cannot be defined because it is used by more than one SFR */
/* Bitname _CHNL4 cannot be defined because it is used by more than one SFR */

/* ADBASE */
#define _CHOFFSET ADBASEbits.CHOFFSET
#define _CHOFFSET0 ADBASEbits.CHOFFSET0
#define _CHOFFSET1 ADBASEbits.CHOFFSET1
#define _CHOFFSET2 ADBASEbits.CHOFFSET2
#define _CHOFFSET3 ADBASEbits.CHOFFSET3
#define _CHOFFSET4 ADBASEbits.CHOFFSET4
#define _CHOFFSET5 ADBASEbits.CHOFFSET5
#define _CHOFFSET6 ADBASEbits.CHOFFSET6
#define _CHOFFSET7 ADBASEbits.CHOFFSET7
#define _CHOFFSET8 ADBASEbits.CHOFFSET8
#define _CHOFFSET9 ADBASEbits.CHOFFSET9
#define _CHOFFSET10 ADBASEbits.CHOFFSET10
#define _CHOFFSET11 ADBASEbits.CHOFFSET11
#define _CHOFFSET12 ADBASEbits.CHOFFSET12
#define _CHOFFSET13 ADBASEbits.CHOFFSET13
#define _CHOFFSET14 ADBASEbits.CHOFFSET14
#define _CHOFFSET15 ADBASEbits.CHOFFSET15

/* ADLVLTRGL */
#define _LVLEN0 ADLVLTRGLbits.LVLEN0
#define _LVLEN1 ADLVLTRGLbits.LVLEN1
#define _LVLEN2 ADLVLTRGLbits.LVLEN2
#define _LVLEN3 ADLVLTRGLbits.LVLEN3
#define _LVLEN4 ADLVLTRGLbits.LVLEN4
#define _LVLEN5 ADLVLTRGLbits.LVLEN5
#define _LVLEN6 ADLVLTRGLbits.LVLEN6
#define _LVLEN7 ADLVLTRGLbits.LVLEN7
#define _LVLEN8 ADLVLTRGLbits.LVLEN8
#define _LVLEN9 ADLVLTRGLbits.LVLEN9
#define _LVLEN10 ADLVLTRGLbits.LVLEN10
#define _LVLEN11 ADLVLTRGLbits.LVLEN11
#define _LVLEN12 ADLVLTRGLbits.LVLEN12
#define _LVLEN13 ADLVLTRGLbits.LVLEN13
#define _LVLEN14 ADLVLTRGLbits.LVLEN14

/* ADCORE0L */
/* Bitname _SAMC cannot be defined because it is used by more than one SFR */
/* Bitname _SAMC0 cannot be defined because it is used by more than one SFR */
/* Bitname _SAMC1 cannot be defined because it is used by more than one SFR */
/* Bitname _SAMC2 cannot be defined because it is used by more than one SFR */
/* Bitname _SAMC3 cannot be defined because it is used by more than one SFR */
/* Bitname _SAMC4 cannot be defined because it is used by more than one SFR */
/* Bitname _SAMC5 cannot be defined because it is used by more than one SFR */
/* Bitname _SAMC6 cannot be defined because it is used by more than one SFR */
/* Bitname _SAMC7 cannot be defined because it is used by more than one SFR */
/* Bitname _SAMC8 cannot be defined because it is used by more than one SFR */
/* Bitname _SAMC9 cannot be defined because it is used by more than one SFR */

