Ryan-Rogers/MMSoftware/MM_2015.X/support/dspic33e/h/p33EP32GS202.h
/* IPC43 */
#define _I2C1BCIP IPC43bits.I2C1BCIP
#define _I2C1BCIP0 IPC43bits.I2C1BCIP0
#define _I2C1BCIP1 IPC43bits.I2C1BCIP1
#define _I2C1BCIP2 IPC43bits.I2C1BCIP2

/* IPC44 */
#define _ADCFLTIP IPC44bits.ADCFLTIP
#define _ADCMP1IP IPC44bits.ADCMP1IP
#define _ADCMP2IP IPC44bits.ADCMP2IP
#define _ADCFLTR1IP IPC44bits.ADCFLTR1IP
#define _ADCFLTIP0 IPC44bits.ADCFLTIP0
#define _ADCFLTIP1 IPC44bits.ADCFLTIP1
#define _ADCFLTIP2 IPC44bits.ADCFLTIP2
#define _ADCMP1IP0 IPC44bits.ADCMP1IP0
#define _ADCMP1IP1 IPC44bits.ADCMP1IP1
#define _ADCMP1IP2 IPC44bits.ADCMP1IP2
#define _ADCMP2IP0 IPC44bits.ADCMP2IP0
#define _ADCMP2IP1 IPC44bits.ADCMP2IP1
#define _ADCMP2IP2 IPC44bits.ADCMP2IP2
#define _ADCFLTR1IP0 IPC44bits.ADCFLTR1IP0
#define _ADCFLTR1IP1 IPC44bits.ADCFLTR1IP1
#define _ADCFLTR1IP2 IPC44bits.ADCFLTR1IP2

/* IPC46 */
#define _ADCC0EIP IPC46bits.ADCC0EIP
#define _ADCC0EIP0 IPC46bits.ADCC0EIP0
#define _ADCC0EIP1 IPC46bits.ADCC0EIP1
#define _ADCC0EIP2 IPC46bits.ADCC0EIP2

/* IPC47 */
#define _ADCC1EIP IPC47bits.ADCC1EIP
#define _ADCC1EIP0 IPC47bits.ADCC1EIP0
#define _ADCC1EIP1 IPC47bits.ADCC1EIP1
#define _ADCC1EIP2 IPC47bits.ADCC1EIP2

/* INTCON1 */
#define _OSCFAIL INTCON1bits.OSCFAIL
#define _STKERR INTCON1bits.STKERR
#define _ADDRERR INTCON1bits.ADDRERR
#define _MATHERR INTCON1bits.MATHERR
#define _DIV0ERR INTCON1bits.DIV0ERR
#define _SFTACERR INTCON1bits.SFTACERR
#define _COVTE INTCON1bits.COVTE
#define _OVBTE INTCON1bits.OVBTE
#define _OVATE INTCON1bits.OVATE
#define _COVBERR INTCON1bits.COVBERR
#define _COVAERR INTCON1bits.COVAERR
#define _OVBERR INTCON1bits.OVBERR
#define _OVAERR INTCON1bits.OVAERR
#define _NSTDIS INTCON1bits.NSTDIS

/* INTCON2 */
#define _INT0EP INTCON2bits.INT0EP
#define _INT1EP INTCON2bits.INT1EP
#define _INT2EP INTCON2bits.INT2EP
#define _INT4EP INTCON2bits.INT4EP
#define _AIVTEN INTCON2bits.AIVTEN
#define _SWTRAP INTCON2bits.SWTRAP
#define _DISI INTCON2bits.DISI
#define _GIE INTCON2bits.GIE

/* INTCON3 */
#define _APLL INTCON3bits.APLL
#define _DOOVR INTCON3bits.DOOVR
#define _NAE INTCON3bits.NAE

/* INTCON4 */
#define _SGHT INTCON4bits.SGHT

/* INTTREG */
#define _VECNUM INTTREGbits.VECNUM
#define _ILR INTTREGbits.ILR
#define _VECNUM0 INTTREGbits.VECNUM0
#define _VECNUM1 INTTREGbits.VECNUM1
#define _VECNUM2 INTTREGbits.VECNUM2
#define _VECNUM3 INTTREGbits.VECNUM3
#define _VECNUM4 INTTREGbits.VECNUM4
#define _VECNUM5 INTTREGbits.VECNUM5
#define _VECNUM6 INTTREGbits.VECNUM6
#define _VECNUM7 INTTREGbits.VECNUM7
#define _ILR0 INTTREGbits.ILR0
#define _ILR1 INTTREGbits.ILR1
#define _ILR2 INTTREGbits.ILR2
#define _ILR3 INTTREGbits.ILR3

/* OC1CON1 */
#define _OCM OC1CON1bits.OCM
#define _TRIGMODE OC1CON1bits.TRIGMODE
#define _OCFLTA OC1CON1bits.OCFLTA
#define _ENFLTA OC1CON1bits.ENFLTA
#define _OCTSEL OC1CON1bits.OCTSEL
#define _OCSIDL OC1CON1bits.OCSIDL
#define _OCM0 OC1CON1bits.OCM0
#define _OCM1 OC1CON1bits.OCM1
#define _OCM2 OC1CON1bits.OCM2
#define _OCFLT OC1CON1bits.OCFLT
#define _ENFLT OC1CON1bits.ENFLT
#define _OCTSEL0 OC1CON1bits.OCTSEL0
#define _OCTSEL1 OC1CON1bits.OCTSEL1
#define _OCTSEL2 OC1CON1bits.OCTSEL2
#define _OCFLT0 OC1CON1bits.OCFLT0
#define _ENFLT0 OC1CON1bits.ENFLT0

/* OC1CON2 */
/* Bitname _SYNCSEL cannot be defined because it is used by more than one SFR */
#define _OCTRIS OC1CON2bits.OCTRIS
/* Bitname _TRIGSTAT cannot be defined because it is used by more than one SFR */
#define _OCTRIG OC1CON2bits.OCTRIG
#define _OC32 OC1CON2bits.OC32
#define _OCINV OC1CON2bits.OCINV
#define _FLTTRIEN OC1CON2bits.FLTTRIEN
#define _FLTOUT OC1CON2bits.FLTOUT
#define _FLTMD OC1CON2bits.FLTMD
/* Bitname _SYNCSEL0 cannot be defined because it is used by more than one SFR */
/* Bitname _SYNCSEL1 cannot be defined because it is used by more than one SFR */
/* Bitname _SYNCSEL2 cannot be defined because it is used by more than one SFR */
/* Bitname _SYNCSEL3 cannot be defined because it is used by more than one SFR */
/* Bitname _SYNCSEL4 cannot be defined because it is used by more than one SFR */
#define _FLTMODE OC1CON2bits.FLTMODE

/* PTCON */
/* Bitname _SEVTPS cannot be defined because it is used by more than one SFR */
/* Bitname _SYNCSRC cannot be defined because it is used by more than one SFR */
/* Bitname _SYNCEN cannot be defined because it is used by more than one SFR */
/* Bitname _SYNCOEN cannot be defined because it is used by more than one SFR */
/* Bitname _SYNCPOL cannot be defined because it is used by more than one SFR */
/* Bitname _EIPU cannot be defined because it is used by more than one SFR */
/* Bitname _SEIEN cannot be defined because it is used by more than one SFR */
/* Bitname _SESTAT cannot be defined because it is used by more than one SFR */
#define _PTSIDL PTCONbits.PTSIDL
#define _PTEN PTCONbits.PTEN
/* Bitname _SEVTPS0 cannot be defined because it is used by more than one SFR */
/* Bitname _SEVTPS1 cannot be defined because it is used by more than one SFR */
/* Bitname _SEVTPS2 cannot be defined because it is used by more than one SFR */
/* Bitname _SEVTPS3 cannot be defined because it is used by more than one SFR */
/* Bitname _SYNCSRC0 cannot be defined because it is used by more than one SFR */
/* Bitname _SYNCSRC1 cannot be defined because it is used by more than one SFR */
/* Bitname _SYNCSRC2 cannot be defined because it is used by more than one SFR */

/* PTCON2 */
/* Bitname _PCLKDIV cannot be defined because it is used by more than one SFR */
/* Bitname _PCLKDIV0 cannot be defined because it is used by more than one SFR */
/* Bitname _PCLKDIV1 cannot be defined because it is used by more than one SFR */
/* Bitname _PCLKDIV2 cannot be defined because it is used by more than one SFR */

/* SEVTCMP */
#define _SEVTCMP SEVTCMPbits.SEVTCMP

/* STCON */
/* Bitname _SEVTPS cannot be defined because it is used by more than one SFR */
/* Bitname _SYNCSRC cannot be defined because it is used by more than one SFR */
/* Bitname _SYNCEN cannot be defined because it is used by more than one SFR */
/* Bitname _SYNCOEN cannot be defined because it is used by more than one SFR */
/* Bitname _SYNCPOL cannot be defined because it is used by more than one SFR */
/* Bitname _EIPU cannot be defined because it is used by more than one SFR */
/* Bitname _SEIEN cannot be defined because it is used by more than one SFR */
/* Bitname _SESTAT cannot be defined because it is used by more than one SFR */
/* Bitname _SEVTPS0 cannot be defined because it is used by more than one SFR */
/* Bitname _SEVTPS1 cannot be defined because it is used by more than one SFR */
/* Bitname _SEVTPS2 cannot be defined because it is used by more than one SFR */
/* Bitname _SEVTPS3 cannot be defined because it is used by more than one SFR */
/* Bitname _SYNCSRC0 cannot be defined because it is used by more than one SFR */
/* Bitname _SYNCSRC1 cannot be defined because it is used by more than one SFR */
/* Bitname _SYNCSRC2 cannot be defined because it is used by more than one SFR */

