Ryan-Rogers/MMSoftware/MM_2015.X/support/dspic33e/h/p33EP32GS202.h
#define _ADMOD0H_SIGN12_POSITION                 0x00000008
#define _ADMOD0H_SIGN12_MASK                     0x00000100
#define _ADMOD0H_SIGN12_LENGTH                   0x00000001

#define _ADMOD0H_DIFF12_POSITION                 0x00000009
#define _ADMOD0H_DIFF12_MASK                     0x00000200
#define _ADMOD0H_DIFF12_LENGTH                   0x00000001

#define _ADMOD0H_SIGN13_POSITION                 0x0000000A
#define _ADMOD0H_SIGN13_MASK                     0x00000400
#define _ADMOD0H_SIGN13_LENGTH                   0x00000001

#define _ADMOD0H_DIFF13_POSITION                 0x0000000B
#define _ADMOD0H_DIFF13_MASK                     0x00000800
#define _ADMOD0H_DIFF13_LENGTH                   0x00000001

#define _ADMOD0H_SIGN14_POSITION                 0x0000000C
#define _ADMOD0H_SIGN14_MASK                     0x00001000
#define _ADMOD0H_SIGN14_LENGTH                   0x00000001

#define _ADMOD0H_DIFF14_POSITION                 0x0000000D
#define _ADMOD0H_DIFF14_MASK                     0x00002000
#define _ADMOD0H_DIFF14_LENGTH                   0x00000001

#define _ADCIE1L_CIE0_POSITION                   0x00000000
#define _ADCIE1L_CIE0_MASK                       0x00000001
#define _ADCIE1L_CIE0_LENGTH                     0x00000001

#define _ADCIE1L_CIE1_POSITION                   0x00000001
#define _ADCIE1L_CIE1_MASK                       0x00000002
#define _ADCIE1L_CIE1_LENGTH                     0x00000001

#define _ADCIE1L_CIE2_POSITION                   0x00000002
#define _ADCIE1L_CIE2_MASK                       0x00000004
#define _ADCIE1L_CIE2_LENGTH                     0x00000001

#define _ADCIE1L_CIE3_POSITION                   0x00000003
#define _ADCIE1L_CIE3_MASK                       0x00000008
#define _ADCIE1L_CIE3_LENGTH                     0x00000001

#define _ADCIE1L_CIE4_POSITION                   0x00000004
#define _ADCIE1L_CIE4_MASK                       0x00000010
#define _ADCIE1L_CIE4_LENGTH                     0x00000001

#define _ADCIE1L_CIE5_POSITION                   0x00000005
#define _ADCIE1L_CIE5_MASK                       0x00000020
#define _ADCIE1L_CIE5_LENGTH                     0x00000001

#define _ADCIE1L_CIE6_POSITION                   0x00000006
#define _ADCIE1L_CIE6_MASK                       0x00000040
#define _ADCIE1L_CIE6_LENGTH                     0x00000001

#define _ADCIE1L_CIE7_POSITION                   0x00000007
#define _ADCIE1L_CIE7_MASK                       0x00000080
#define _ADCIE1L_CIE7_LENGTH                     0x00000001

#define _ADCIE1L_CIE8_POSITION                   0x00000008
#define _ADCIE1L_CIE8_MASK                       0x00000100
#define _ADCIE1L_CIE8_LENGTH                     0x00000001

#define _ADCIE1L_CIE9_POSITION                   0x00000009
#define _ADCIE1L_CIE9_MASK                       0x00000200
#define _ADCIE1L_CIE9_LENGTH                     0x00000001

#define _ADCIE1L_CIE10_POSITION                  0x0000000A
#define _ADCIE1L_CIE10_MASK                      0x00000400
#define _ADCIE1L_CIE10_LENGTH                    0x00000001

#define _ADCIE1L_CIE11_POSITION                  0x0000000B
#define _ADCIE1L_CIE11_MASK                      0x00000800
#define _ADCIE1L_CIE11_LENGTH                    0x00000001

#define _ADCIE1L_CIE12_POSITION                  0x0000000C
#define _ADCIE1L_CIE12_MASK                      0x00001000
#define _ADCIE1L_CIE12_LENGTH                    0x00000001

#define _ADCIE1L_CIE13_POSITION                  0x0000000D
#define _ADCIE1L_CIE13_MASK                      0x00002000
#define _ADCIE1L_CIE13_LENGTH                    0x00000001

#define _ADCIE1L_CIE14_POSITION                  0x0000000E
#define _ADCIE1L_CIE14_MASK                      0x00004000
#define _ADCIE1L_CIE14_LENGTH                    0x00000001

#define _ADCSS1L_CSS0_POSITION                   0x00000000
#define _ADCSS1L_CSS0_MASK                       0x00000001
#define _ADCSS1L_CSS0_LENGTH                     0x00000001

#define _ADCSS1L_CSS1_POSITION                   0x00000001
#define _ADCSS1L_CSS1_MASK                       0x00000002
#define _ADCSS1L_CSS1_LENGTH                     0x00000001

#define _ADCSS1L_CSS2_POSITION                   0x00000002
#define _ADCSS1L_CSS2_MASK                       0x00000004
#define _ADCSS1L_CSS2_LENGTH                     0x00000001

#define _ADCSS1L_CSS3_POSITION                   0x00000003
#define _ADCSS1L_CSS3_MASK                       0x00000008
#define _ADCSS1L_CSS3_LENGTH                     0x00000001

#define _ADCSS1L_CSS4_POSITION                   0x00000004
#define _ADCSS1L_CSS4_MASK                       0x00000010
#define _ADCSS1L_CSS4_LENGTH                     0x00000001

#define _ADCSS1L_CSS5_POSITION                   0x00000005
#define _ADCSS1L_CSS5_MASK                       0x00000020
#define _ADCSS1L_CSS5_LENGTH                     0x00000001

#define _ADCSS1L_CSS6_POSITION                   0x00000006
#define _ADCSS1L_CSS6_MASK                       0x00000040
#define _ADCSS1L_CSS6_LENGTH                     0x00000001

#define _ADCSS1L_CSS7_POSITION                   0x00000007
#define _ADCSS1L_CSS7_MASK                       0x00000080
#define _ADCSS1L_CSS7_LENGTH                     0x00000001

#define _ADCSS1L_CSS8_POSITION                   0x00000008
#define _ADCSS1L_CSS8_MASK                       0x00000100
#define _ADCSS1L_CSS8_LENGTH                     0x00000001

#define _ADCSS1L_CSS9_POSITION                   0x00000009
#define _ADCSS1L_CSS9_MASK                       0x00000200
#define _ADCSS1L_CSS9_LENGTH                     0x00000001

#define _ADCSS1L_CSS10_POSITION                  0x0000000A
#define _ADCSS1L_CSS10_MASK                      0x00000400
#define _ADCSS1L_CSS10_LENGTH                    0x00000001

#define _ADCSS1L_CSS11_POSITION                  0x0000000B
#define _ADCSS1L_CSS11_MASK                      0x00000800
#define _ADCSS1L_CSS11_LENGTH                    0x00000001

#define _ADCSS1L_CSS12_POSITION                  0x0000000C
#define _ADCSS1L_CSS12_MASK                      0x00001000
#define _ADCSS1L_CSS12_LENGTH                    0x00000001

