Ryan-Rogers/MMSoftware/MM_2015.X/support/dspic33e/h/p33EP32GS202.h
#define _ADTRIG0L_TRGSRC10_POSITION              0x00000008
#define _ADTRIG0L_TRGSRC10_MASK                  0x00000100
#define _ADTRIG0L_TRGSRC10_LENGTH                0x00000001

#define _ADTRIG0L_TRGSRC11_POSITION              0x00000009
#define _ADTRIG0L_TRGSRC11_MASK                  0x00000200
#define _ADTRIG0L_TRGSRC11_LENGTH                0x00000001

#define _ADTRIG0L_TRGSRC12_POSITION              0x0000000A
#define _ADTRIG0L_TRGSRC12_MASK                  0x00000400
#define _ADTRIG0L_TRGSRC12_LENGTH                0x00000001

#define _ADTRIG0L_TRGSRC13_POSITION              0x0000000B
#define _ADTRIG0L_TRGSRC13_MASK                  0x00000800
#define _ADTRIG0L_TRGSRC13_LENGTH                0x00000001

#define _ADTRIG0L_TRGSRC14_POSITION              0x0000000C
#define _ADTRIG0L_TRGSRC14_MASK                  0x00001000
#define _ADTRIG0L_TRGSRC14_LENGTH                0x00000001

#define _ADTRIG0H_TRGSRC2_POSITION               0x00000000
#define _ADTRIG0H_TRGSRC2_MASK                   0x0000001F
#define _ADTRIG0H_TRGSRC2_LENGTH                 0x00000005

#define _ADTRIG0H_TRGSRC3_POSITION               0x00000008
#define _ADTRIG0H_TRGSRC3_MASK                   0x00001F00
#define _ADTRIG0H_TRGSRC3_LENGTH                 0x00000005

#define _ADTRIG0H_TRGSRC40_POSITION              0x00000000
#define _ADTRIG0H_TRGSRC40_MASK                  0x00000001
#define _ADTRIG0H_TRGSRC40_LENGTH                0x00000001

#define _ADTRIG0H_TRGSRC41_POSITION              0x00000001
#define _ADTRIG0H_TRGSRC41_MASK                  0x00000002
#define _ADTRIG0H_TRGSRC41_LENGTH                0x00000001

#define _ADTRIG0H_TRGSRC42_POSITION              0x00000002
#define _ADTRIG0H_TRGSRC42_MASK                  0x00000004
#define _ADTRIG0H_TRGSRC42_LENGTH                0x00000001

#define _ADTRIG0H_TRGSRC43_POSITION              0x00000003
#define _ADTRIG0H_TRGSRC43_MASK                  0x00000008
#define _ADTRIG0H_TRGSRC43_LENGTH                0x00000001

#define _ADTRIG0H_TRGSRC44_POSITION              0x00000004
#define _ADTRIG0H_TRGSRC44_MASK                  0x00000010
#define _ADTRIG0H_TRGSRC44_LENGTH                0x00000001

#define _ADTRIG0H_TRGSRC30_POSITION              0x00000008
#define _ADTRIG0H_TRGSRC30_MASK                  0x00000100
#define _ADTRIG0H_TRGSRC30_LENGTH                0x00000001

#define _ADTRIG0H_TRGSRC31_POSITION              0x00000009
#define _ADTRIG0H_TRGSRC31_MASK                  0x00000200
#define _ADTRIG0H_TRGSRC31_LENGTH                0x00000001

#define _ADTRIG0H_TRGSRC32_POSITION              0x0000000A
#define _ADTRIG0H_TRGSRC32_MASK                  0x00000400
#define _ADTRIG0H_TRGSRC32_LENGTH                0x00000001

#define _ADTRIG0H_TRGSRC33_POSITION              0x0000000B
#define _ADTRIG0H_TRGSRC33_MASK                  0x00000800
#define _ADTRIG0H_TRGSRC33_LENGTH                0x00000001

#define _ADTRIG0H_TRGSRC34_POSITION              0x0000000C
#define _ADTRIG0H_TRGSRC34_MASK                  0x00001000
#define _ADTRIG0H_TRGSRC34_LENGTH                0x00000001

#define _ADTRIG1L_TRGSRC4_POSITION               0x00000000
#define _ADTRIG1L_TRGSRC4_MASK                   0x0000001F
#define _ADTRIG1L_TRGSRC4_LENGTH                 0x00000005

#define _ADTRIG1L_TRGSRC5_POSITION               0x00000008
#define _ADTRIG1L_TRGSRC5_MASK                   0x00001F00
#define _ADTRIG1L_TRGSRC5_LENGTH                 0x00000005

#define _ADTRIG1L_TRGSRC60_POSITION              0x00000000
#define _ADTRIG1L_TRGSRC60_MASK                  0x00000001
#define _ADTRIG1L_TRGSRC60_LENGTH                0x00000001

#define _ADTRIG1L_TRGSRC61_POSITION              0x00000001
#define _ADTRIG1L_TRGSRC61_MASK                  0x00000002
#define _ADTRIG1L_TRGSRC61_LENGTH                0x00000001

#define _ADTRIG1L_TRGSRC62_POSITION              0x00000002
#define _ADTRIG1L_TRGSRC62_MASK                  0x00000004
#define _ADTRIG1L_TRGSRC62_LENGTH                0x00000001

#define _ADTRIG1L_TRGSRC63_POSITION              0x00000003
#define _ADTRIG1L_TRGSRC63_MASK                  0x00000008
#define _ADTRIG1L_TRGSRC63_LENGTH                0x00000001

#define _ADTRIG1L_TRGSRC64_POSITION              0x00000004
#define _ADTRIG1L_TRGSRC64_MASK                  0x00000010
#define _ADTRIG1L_TRGSRC64_LENGTH                0x00000001

#define _ADTRIG1L_TRGSRC50_POSITION              0x00000008
#define _ADTRIG1L_TRGSRC50_MASK                  0x00000100
#define _ADTRIG1L_TRGSRC50_LENGTH                0x00000001

#define _ADTRIG1L_TRGSRC51_POSITION              0x00000009
#define _ADTRIG1L_TRGSRC51_MASK                  0x00000200
#define _ADTRIG1L_TRGSRC51_LENGTH                0x00000001

#define _ADTRIG1L_TRGSRC52_POSITION              0x0000000A
#define _ADTRIG1L_TRGSRC52_MASK                  0x00000400
#define _ADTRIG1L_TRGSRC52_LENGTH                0x00000001

#define _ADTRIG1L_TRGSRC53_POSITION              0x0000000B
#define _ADTRIG1L_TRGSRC53_MASK                  0x00000800
#define _ADTRIG1L_TRGSRC53_LENGTH                0x00000001

#define _ADTRIG1L_TRGSRC54_POSITION              0x0000000C
#define _ADTRIG1L_TRGSRC54_MASK                  0x00001000
#define _ADTRIG1L_TRGSRC54_LENGTH                0x00000001

#define _ADTRIG1H_TRGSRC6_POSITION               0x00000000
#define _ADTRIG1H_TRGSRC6_MASK                   0x0000001F
#define _ADTRIG1H_TRGSRC6_LENGTH                 0x00000005

#define _ADTRIG1H_TRGSRC7_POSITION               0x00000008
#define _ADTRIG1H_TRGSRC7_MASK                   0x00001F00
#define _ADTRIG1H_TRGSRC7_LENGTH                 0x00000005

#define _ADTRIG1H_TRGSRC80_POSITION              0x00000000
#define _ADTRIG1H_TRGSRC80_MASK                  0x00000001
#define _ADTRIG1H_TRGSRC80_LENGTH                0x00000001

#define _ADTRIG1H_TRGSRC81_POSITION              0x00000001
#define _ADTRIG1H_TRGSRC81_MASK                  0x00000002
#define _ADTRIG1H_TRGSRC81_LENGTH                0x00000001

#define _ADTRIG1H_TRGSRC82_POSITION              0x00000002
#define _ADTRIG1H_TRGSRC82_MASK                  0x00000004
#define _ADTRIG1H_TRGSRC82_LENGTH                0x00000001

