Ryan-Rogers/MMSoftware/MM_2015.X/support/dspic33e/h/p33EP32GS202.h
#define _ADTRIG3L_TRGSRC141_POSITION             0x00000001
#define _ADTRIG3L_TRGSRC141_MASK                 0x00000002
#define _ADTRIG3L_TRGSRC141_LENGTH               0x00000001

#define _ADTRIG3L_TRGSRC142_POSITION             0x00000002
#define _ADTRIG3L_TRGSRC142_MASK                 0x00000004
#define _ADTRIG3L_TRGSRC142_LENGTH               0x00000001

#define _ADTRIG3L_TRGSRC143_POSITION             0x00000003
#define _ADTRIG3L_TRGSRC143_MASK                 0x00000008
#define _ADTRIG3L_TRGSRC143_LENGTH               0x00000001

#define _ADTRIG3L_TRGSRC144_POSITION             0x00000004
#define _ADTRIG3L_TRGSRC144_MASK                 0x00000010
#define _ADTRIG3L_TRGSRC144_LENGTH               0x00000001

#define _ADTRIG3L_TRGSRC130_POSITION             0x00000008
#define _ADTRIG3L_TRGSRC130_MASK                 0x00000100
#define _ADTRIG3L_TRGSRC130_LENGTH               0x00000001

#define _ADTRIG3L_TRGSRC131_POSITION             0x00000009
#define _ADTRIG3L_TRGSRC131_MASK                 0x00000200
#define _ADTRIG3L_TRGSRC131_LENGTH               0x00000001

#define _ADTRIG3L_TRGSRC132_POSITION             0x0000000A
#define _ADTRIG3L_TRGSRC132_MASK                 0x00000400
#define _ADTRIG3L_TRGSRC132_LENGTH               0x00000001

#define _ADTRIG3L_TRGSRC133_POSITION             0x0000000B
#define _ADTRIG3L_TRGSRC133_MASK                 0x00000800
#define _ADTRIG3L_TRGSRC133_LENGTH               0x00000001

#define _ADTRIG3L_TRGSRC134_POSITION             0x0000000C
#define _ADTRIG3L_TRGSRC134_MASK                 0x00001000
#define _ADTRIG3L_TRGSRC134_LENGTH               0x00000001

#define _ADTRIG3H_TRGSRC14_POSITION              0x00000000
#define _ADTRIG3H_TRGSRC14_MASK                  0x0000001F
#define _ADTRIG3H_TRGSRC14_LENGTH                0x00000005

#define _ADTRIG3H_TRGSRC160_POSITION             0x00000000
#define _ADTRIG3H_TRGSRC160_MASK                 0x00000001
#define _ADTRIG3H_TRGSRC160_LENGTH               0x00000001

#define _ADTRIG3H_TRGSRC161_POSITION             0x00000001
#define _ADTRIG3H_TRGSRC161_MASK                 0x00000002
#define _ADTRIG3H_TRGSRC161_LENGTH               0x00000001

#define _ADTRIG3H_TRGSRC162_POSITION             0x00000002
#define _ADTRIG3H_TRGSRC162_MASK                 0x00000004
#define _ADTRIG3H_TRGSRC162_LENGTH               0x00000001

#define _ADTRIG3H_TRGSRC163_POSITION             0x00000003
#define _ADTRIG3H_TRGSRC163_MASK                 0x00000008
#define _ADTRIG3H_TRGSRC163_LENGTH               0x00000001

#define _ADTRIG3H_TRGSRC164_POSITION             0x00000004
#define _ADTRIG3H_TRGSRC164_MASK                 0x00000010
#define _ADTRIG3H_TRGSRC164_LENGTH               0x00000001

#define _ADCMP0CON_LOLO_POSITION                 0x00000000
#define _ADCMP0CON_LOLO_MASK                     0x00000001
#define _ADCMP0CON_LOLO_LENGTH                   0x00000001

#define _ADCMP0CON_LOHI_POSITION                 0x00000001
#define _ADCMP0CON_LOHI_MASK                     0x00000002
#define _ADCMP0CON_LOHI_LENGTH                   0x00000001

#define _ADCMP0CON_HILO_POSITION                 0x00000002
#define _ADCMP0CON_HILO_MASK                     0x00000004
#define _ADCMP0CON_HILO_LENGTH                   0x00000001

#define _ADCMP0CON_HIHI_POSITION                 0x00000003
#define _ADCMP0CON_HIHI_MASK                     0x00000008
#define _ADCMP0CON_HIHI_LENGTH                   0x00000001

#define _ADCMP0CON_BTWN_POSITION                 0x00000004
#define _ADCMP0CON_BTWN_MASK                     0x00000010
#define _ADCMP0CON_BTWN_LENGTH                   0x00000001

#define _ADCMP0CON_STAT_POSITION                 0x00000005
#define _ADCMP0CON_STAT_MASK                     0x00000020
#define _ADCMP0CON_STAT_LENGTH                   0x00000001

#define _ADCMP0CON_CIE_POSITION                  0x00000006
#define _ADCMP0CON_CIE_MASK                      0x00000040
#define _ADCMP0CON_CIE_LENGTH                    0x00000001

#define _ADCMP0CON_CMPEN_POSITION                0x00000007
#define _ADCMP0CON_CMPEN_MASK                    0x00000080
#define _ADCMP0CON_CMPEN_LENGTH                  0x00000001

#define _ADCMP0CON_CHNL_POSITION                 0x00000008
#define _ADCMP0CON_CHNL_MASK                     0x00001F00
#define _ADCMP0CON_CHNL_LENGTH                   0x00000005

#define _ADCMP0CON_CHNL0_POSITION                0x00000008
#define _ADCMP0CON_CHNL0_MASK                    0x00000100
#define _ADCMP0CON_CHNL0_LENGTH                  0x00000001

#define _ADCMP0CON_CHNL1_POSITION                0x00000009
#define _ADCMP0CON_CHNL1_MASK                    0x00000200
#define _ADCMP0CON_CHNL1_LENGTH                  0x00000001

#define _ADCMP0CON_CHNL2_POSITION                0x0000000A
#define _ADCMP0CON_CHNL2_MASK                    0x00000400
#define _ADCMP0CON_CHNL2_LENGTH                  0x00000001

#define _ADCMP0CON_CHNL3_POSITION                0x0000000B
#define _ADCMP0CON_CHNL3_MASK                    0x00000800
#define _ADCMP0CON_CHNL3_LENGTH                  0x00000001

#define _ADCMP0CON_CHNL4_POSITION                0x0000000C
#define _ADCMP0CON_CHNL4_MASK                    0x00001000
#define _ADCMP0CON_CHNL4_LENGTH                  0x00000001

#define _ADCMP1CON_LOLO_POSITION                 0x00000000
#define _ADCMP1CON_LOLO_MASK                     0x00000001
#define _ADCMP1CON_LOLO_LENGTH                   0x00000001

#define _ADCMP1CON_LOHI_POSITION                 0x00000001
#define _ADCMP1CON_LOHI_MASK                     0x00000002
#define _ADCMP1CON_LOHI_LENGTH                   0x00000001

#define _ADCMP1CON_HILO_POSITION                 0x00000002
#define _ADCMP1CON_HILO_MASK                     0x00000004
#define _ADCMP1CON_HILO_LENGTH                   0x00000001

#define _ADCMP1CON_HIHI_POSITION                 0x00000003
#define _ADCMP1CON_HIHI_MASK                     0x00000008
#define _ADCMP1CON_HIHI_LENGTH                   0x00000001

#define _ADCMP1CON_BTWN_POSITION                 0x00000004
#define _ADCMP1CON_BTWN_MASK                     0x00000010
#define _ADCMP1CON_BTWN_LENGTH                   0x00000001

#define _ADCMP1CON_STAT_POSITION                 0x00000005
#define _ADCMP1CON_STAT_MASK                     0x00000020
#define _ADCMP1CON_STAT_LENGTH                   0x00000001

