Ryan-Rogers/MMSoftware/MM_2015.X/support/dspic33e/h/p33EP32GS202.h
#define _ADCORE1L_SAMC7_POSITION                 0x00000007
#define _ADCORE1L_SAMC7_MASK                     0x00000080
#define _ADCORE1L_SAMC7_LENGTH                   0x00000001

#define _ADCORE1L_SAMC8_POSITION                 0x00000008
#define _ADCORE1L_SAMC8_MASK                     0x00000100
#define _ADCORE1L_SAMC8_LENGTH                   0x00000001

#define _ADCORE1L_SAMC9_POSITION                 0x00000009
#define _ADCORE1L_SAMC9_MASK                     0x00000200
#define _ADCORE1L_SAMC9_LENGTH                   0x00000001

#define _ADCORE1H_ADCS_POSITION                  0x00000000
#define _ADCORE1H_ADCS_MASK                      0x0000007F
#define _ADCORE1H_ADCS_LENGTH                    0x00000007

#define _ADCORE1H_RES_POSITION                   0x00000008
#define _ADCORE1H_RES_MASK                       0x00000300
#define _ADCORE1H_RES_LENGTH                     0x00000002

#define _ADCORE1H_EISEL_POSITION                 0x0000000A
#define _ADCORE1H_EISEL_MASK                     0x00001C00
#define _ADCORE1H_EISEL_LENGTH                   0x00000003

#define _ADCORE1H_ADCS0_POSITION                 0x00000000
#define _ADCORE1H_ADCS0_MASK                     0x00000001
#define _ADCORE1H_ADCS0_LENGTH                   0x00000001

#define _ADCORE1H_ADCS1_POSITION                 0x00000001
#define _ADCORE1H_ADCS1_MASK                     0x00000002
#define _ADCORE1H_ADCS1_LENGTH                   0x00000001

#define _ADCORE1H_ADCS2_POSITION                 0x00000002
#define _ADCORE1H_ADCS2_MASK                     0x00000004
#define _ADCORE1H_ADCS2_LENGTH                   0x00000001

#define _ADCORE1H_ADCS3_POSITION                 0x00000003
#define _ADCORE1H_ADCS3_MASK                     0x00000008
#define _ADCORE1H_ADCS3_LENGTH                   0x00000001

#define _ADCORE1H_ADCS4_POSITION                 0x00000004
#define _ADCORE1H_ADCS4_MASK                     0x00000010
#define _ADCORE1H_ADCS4_LENGTH                   0x00000001

#define _ADCORE1H_ADCS5_POSITION                 0x00000005
#define _ADCORE1H_ADCS5_MASK                     0x00000020
#define _ADCORE1H_ADCS5_LENGTH                   0x00000001

#define _ADCORE1H_ADCS6_POSITION                 0x00000006
#define _ADCORE1H_ADCS6_MASK                     0x00000040
#define _ADCORE1H_ADCS6_LENGTH                   0x00000001

#define _ADCORE1H_RES0_POSITION                  0x00000008
#define _ADCORE1H_RES0_MASK                      0x00000100
#define _ADCORE1H_RES0_LENGTH                    0x00000001

#define _ADCORE1H_RES1_POSITION                  0x00000009
#define _ADCORE1H_RES1_MASK                      0x00000200
#define _ADCORE1H_RES1_LENGTH                    0x00000001

#define _ADCORE1H_EISEL0_POSITION                0x0000000A
#define _ADCORE1H_EISEL0_MASK                    0x00000400
#define _ADCORE1H_EISEL0_LENGTH                  0x00000001

#define _ADCORE1H_EISEL1_POSITION                0x0000000B
#define _ADCORE1H_EISEL1_MASK                    0x00000800
#define _ADCORE1H_EISEL1_LENGTH                  0x00000001

#define _ADCORE1H_EISEL2_POSITION                0x0000000C
#define _ADCORE1H_EISEL2_MASK                    0x00001000
#define _ADCORE1H_EISEL2_LENGTH                  0x00000001

#define _ADEICONL_C0EIF_POSITION                 0x00000000
#define _ADEICONL_C0EIF_MASK                     0x00000001
#define _ADEICONL_C0EIF_LENGTH                   0x00000001

#define _ADEICONL_C1EIF_POSITION                 0x00000001
#define _ADEICONL_C1EIF_MASK                     0x00000002
#define _ADEICONL_C1EIF_LENGTH                   0x00000001

#define _ADEICONL_SHREIF_POSITION                0x00000007
#define _ADEICONL_SHREIF_MASK                    0x00000080
#define _ADEICONL_SHREIF_LENGTH                  0x00000001

#define _ADEICONL_C0EIEN_POSITION                0x00000008
#define _ADEICONL_C0EIEN_MASK                    0x00000100
#define _ADEICONL_C0EIEN_LENGTH                  0x00000001

#define _ADEICONL_C1EIEN_POSITION                0x00000009
#define _ADEICONL_C1EIEN_MASK                    0x00000200
#define _ADEICONL_C1EIEN_LENGTH                  0x00000001

#define _ADEICONL_SHREIEN_POSITION               0x0000000F
#define _ADEICONL_SHREIEN_MASK                   0x00008000
#define _ADEICONL_SHREIEN_LENGTH                 0x00000001

#define _ADEICONH_SHREICH_POSITION               0x00000000
#define _ADEICONH_SHREICH_MASK                   0x0000003F
#define _ADEICONH_SHREICH_LENGTH                 0x00000006

#define _ADCON5L_C0PWR_POSITION                  0x00000000
#define _ADCON5L_C0PWR_MASK                      0x00000001
#define _ADCON5L_C0PWR_LENGTH                    0x00000001

#define _ADCON5L_C1PWR_POSITION                  0x00000001
#define _ADCON5L_C1PWR_MASK                      0x00000002
#define _ADCON5L_C1PWR_LENGTH                    0x00000001

#define _ADCON5L_SHRPWR_POSITION                 0x00000007
#define _ADCON5L_SHRPWR_MASK                     0x00000080
#define _ADCON5L_SHRPWR_LENGTH                   0x00000001

#define _ADCON5L_C0RDY_POSITION                  0x00000008
#define _ADCON5L_C0RDY_MASK                      0x00000100
#define _ADCON5L_C0RDY_LENGTH                    0x00000001

#define _ADCON5L_C1RDY_POSITION                  0x00000009
#define _ADCON5L_C1RDY_MASK                      0x00000200
#define _ADCON5L_C1RDY_LENGTH                    0x00000001

#define _ADCON5L_SHRRDY_POSITION                 0x0000000F
#define _ADCON5L_SHRRDY_MASK                     0x00008000
#define _ADCON5L_SHRRDY_LENGTH                   0x00000001

#define _ADCON5H_C0C1E_POSITION                  0x00000000
#define _ADCON5H_C0C1E_MASK                      0x00000001
#define _ADCON5H_C0C1E_LENGTH                    0x00000001

#define _ADCON5H_C1C1E_POSITION                  0x00000001
#define _ADCON5H_C1C1E_MASK                      0x00000002
#define _ADCON5H_C1C1E_LENGTH                    0x00000001

#define _ADCON5H_C2C1E_POSITION                  0x00000002
#define _ADCON5H_C2C1E_MASK                      0x00000004
#define _ADCON5H_C2C1E_LENGTH                    0x00000001

#define _ADCON5H_C3C1E_POSITION                  0x00000003
#define _ADCON5H_C3C1E_MASK                      0x00000008
#define _ADCON5H_C3C1E_LENGTH                    0x00000001

#define _ADCON5H_C4C1E_POSITION                  0x00000004
#define _ADCON5H_C4C1E_MASK                      0x00000010
#define _ADCON5H_C4C1E_LENGTH                    0x00000001

#define _ADCON5H_C5C1E_POSITION                  0x00000005
#define _ADCON5H_C5C1E_MASK                      0x00000020
#define _ADCON5H_C5C1E_LENGTH                    0x00000001

#define _ADCON5H_C6C1E_POSITION                  0x00000006
#define _ADCON5H_C6C1E_MASK                      0x00000040
#define _ADCON5H_C6C1E_LENGTH                    0x00000001

#define _ADCON5H_SHRCIE_POSITION                 0x00000007
#define _ADCON5H_SHRCIE_MASK                     0x00000080
#define _ADCON5H_SHRCIE_LENGTH                   0x00000001

#define _ADCON5H_WARMTIME_POSITION               0x00000008
#define _ADCON5H_WARMTIME_MASK                   0x00001F00
#define _ADCON5H_WARMTIME_LENGTH                 0x00000005

