Ryan-Rogers/MMSoftware/MM_2015.X/support/dspic33e/h/p33EP32GS202.h
#define _ADCAL0L_CAL0RUN_POSITION                0x00000000
#define _ADCAL0L_CAL0RUN_MASK                    0x00000001
#define _ADCAL0L_CAL0RUN_LENGTH                  0x00000001

#define _ADCAL0L_CAL0EN_POSITION                 0x00000001
#define _ADCAL0L_CAL0EN_MASK                     0x00000002
#define _ADCAL0L_CAL0EN_LENGTH                   0x00000001

#define _ADCAL0L_CAL0DIFF_POSITION               0x00000002
#define _ADCAL0L_CAL0DIFF_MASK                   0x00000004
#define _ADCAL0L_CAL0DIFF_LENGTH                 0x00000001

#define _ADCAL0L_CAL0SKIP_POSITION               0x00000003
#define _ADCAL0L_CAL0SKIP_MASK                   0x00000008
#define _ADCAL0L_CAL0SKIP_LENGTH                 0x00000001

#define _ADCAL0L_CAL0RDY_POSITION                0x00000007
#define _ADCAL0L_CAL0RDY_MASK                    0x00000080
#define _ADCAL0L_CAL0RDY_LENGTH                  0x00000001

#define _ADCAL0L_CAL1RUN_POSITION                0x00000008
#define _ADCAL0L_CAL1RUN_MASK                    0x00000100
#define _ADCAL0L_CAL1RUN_LENGTH                  0x00000001

#define _ADCAL0L_CAL1EN_POSITION                 0x00000009
#define _ADCAL0L_CAL1EN_MASK                     0x00000200
#define _ADCAL0L_CAL1EN_LENGTH                   0x00000001

#define _ADCAL0L_CAL1DIFF_POSITION               0x0000000A
#define _ADCAL0L_CAL1DIFF_MASK                   0x00000400
#define _ADCAL0L_CAL1DIFF_LENGTH                 0x00000001

#define _ADCAL0L_CAL1SKIP_POSITION               0x0000000B
#define _ADCAL0L_CAL1SKIP_MASK                   0x00000800
#define _ADCAL0L_CAL1SKIP_LENGTH                 0x00000001

#define _ADCAL0L_CAL1RDY_POSITION                0x0000000F
#define _ADCAL0L_CAL1RDY_MASK                    0x00008000
#define _ADCAL0L_CAL1RDY_LENGTH                  0x00000001

#define _ADCAL1H_CSHRRUN_POSITION                0x00000008
#define _ADCAL1H_CSHRRUN_MASK                    0x00000100
#define _ADCAL1H_CSHRRUN_LENGTH                  0x00000001

#define _ADCAL1H_CSHREN_POSITION                 0x00000009
#define _ADCAL1H_CSHREN_MASK                     0x00000200
#define _ADCAL1H_CSHREN_LENGTH                   0x00000001

#define _ADCAL1H_CSHRDIFF_POSITION               0x0000000A
#define _ADCAL1H_CSHRDIFF_MASK                   0x00000400
#define _ADCAL1H_CSHRDIFF_LENGTH                 0x00000001

#define _ADCAL1H_CSHRSKIP_POSITION               0x0000000B
#define _ADCAL1H_CSHRSKIP_MASK                   0x00000800
#define _ADCAL1H_CSHRSKIP_LENGTH                 0x00000001

#define _ADCAL1H_CSHRRDY_POSITION                0x0000000F
#define _ADCAL1H_CSHRRDY_MASK                    0x00008000
#define _ADCAL1H_CSHRRDY_LENGTH                  0x00000001

#define _PGA1CON_GAIN_POSITION                   0x00000000
#define _PGA1CON_GAIN_MASK                       0x00000007
#define _PGA1CON_GAIN_LENGTH                     0x00000003

#define _PGA1CON_SELNI_POSITION                  0x00000008
#define _PGA1CON_SELNI_MASK                      0x00000700
#define _PGA1CON_SELNI_LENGTH                    0x00000003

#define _PGA1CON_SELPI_POSITION                  0x0000000B
#define _PGA1CON_SELPI_MASK                      0x00003800
#define _PGA1CON_SELPI_LENGTH                    0x00000003

#define _PGA1CON_PGAOEN_POSITION                 0x0000000E
#define _PGA1CON_PGAOEN_MASK                     0x00004000
#define _PGA1CON_PGAOEN_LENGTH                   0x00000001

#define _PGA1CON_PGAEN_POSITION                  0x0000000F
#define _PGA1CON_PGAEN_MASK                      0x00008000
#define _PGA1CON_PGAEN_LENGTH                    0x00000001

#define _PGA1CON_GAIN0_POSITION                  0x00000000
#define _PGA1CON_GAIN0_MASK                      0x00000001
#define _PGA1CON_GAIN0_LENGTH                    0x00000001

#define _PGA1CON_GAIN1_POSITION                  0x00000001
#define _PGA1CON_GAIN1_MASK                      0x00000002
#define _PGA1CON_GAIN1_LENGTH                    0x00000001

#define _PGA1CON_GAIN2_POSITION                  0x00000002
#define _PGA1CON_GAIN2_MASK                      0x00000004
#define _PGA1CON_GAIN2_LENGTH                    0x00000001

#define _PGA1CON_SELNI0_POSITION                 0x00000008
#define _PGA1CON_SELNI0_MASK                     0x00000100
#define _PGA1CON_SELNI0_LENGTH                   0x00000001

#define _PGA1CON_SELNI1_POSITION                 0x00000009
#define _PGA1CON_SELNI1_MASK                     0x00000200
#define _PGA1CON_SELNI1_LENGTH                   0x00000001

#define _PGA1CON_SELNI2_POSITION                 0x0000000A
#define _PGA1CON_SELNI2_MASK                     0x00000400
#define _PGA1CON_SELNI2_LENGTH                   0x00000001

#define _PGA1CON_SELPI0_POSITION                 0x0000000B
#define _PGA1CON_SELPI0_MASK                     0x00000800
#define _PGA1CON_SELPI0_LENGTH                   0x00000001

#define _PGA1CON_SELPI1_POSITION                 0x0000000C
#define _PGA1CON_SELPI1_MASK                     0x00001000
#define _PGA1CON_SELPI1_LENGTH                   0x00000001

#define _PGA1CON_SELPI2_POSITION                 0x0000000D
#define _PGA1CON_SELPI2_MASK                     0x00002000
#define _PGA1CON_SELPI2_LENGTH                   0x00000001

#define _PGA1CAL_PGACAL_POSITION                 0x00000000
#define _PGA1CAL_PGACAL_MASK                     0x0000003F
#define _PGA1CAL_PGACAL_LENGTH                   0x00000006

#define _PGA2CON_GAIN_POSITION                   0x00000000
#define _PGA2CON_GAIN_MASK                       0x00000007
#define _PGA2CON_GAIN_LENGTH                     0x00000003

#define _PGA2CON_SELNI_POSITION                  0x00000008
#define _PGA2CON_SELNI_MASK                      0x00000700
#define _PGA2CON_SELNI_LENGTH                    0x00000003

#define _PGA2CON_SELPI_POSITION                  0x0000000B
#define _PGA2CON_SELPI_MASK                      0x00003800
#define _PGA2CON_SELPI_LENGTH                    0x00000003

#define _PGA2CON_PGAOEN_POSITION                 0x0000000E
#define _PGA2CON_PGAOEN_MASK                     0x00004000
#define _PGA2CON_PGAOEN_LENGTH                   0x00000001

#define _PGA2CON_PGAEN_POSITION                  0x0000000F
#define _PGA2CON_PGAEN_MASK                      0x00008000
#define _PGA2CON_PGAEN_LENGTH                    0x00000001

#define _PGA2CON_GAIN0_POSITION                  0x00000000
#define _PGA2CON_GAIN0_MASK                      0x00000001
#define _PGA2CON_GAIN0_LENGTH                    0x00000001

#define _PGA2CON_GAIN1_POSITION                  0x00000001
#define _PGA2CON_GAIN1_MASK                      0x00000002
#define _PGA2CON_GAIN1_LENGTH                    0x00000001

#define _PGA2CON_GAIN2_POSITION                  0x00000002
#define _PGA2CON_GAIN2_MASK                      0x00000004
#define _PGA2CON_GAIN2_LENGTH                    0x00000001

#define _PGA2CON_SELNI0_POSITION                 0x00000008
#define _PGA2CON_SELNI0_MASK                     0x00000100
#define _PGA2CON_SELNI0_LENGTH                   0x00000001

#define _PGA2CON_SELNI1_POSITION                 0x00000009
#define _PGA2CON_SELNI1_MASK                     0x00000200
#define _PGA2CON_SELNI1_LENGTH                   0x00000001

#define _PGA2CON_SELNI2_POSITION                 0x0000000A
#define _PGA2CON_SELNI2_MASK                     0x00000400
#define _PGA2CON_SELNI2_LENGTH                   0x00000001

#define _PGA2CON_SELPI0_POSITION                 0x0000000B
#define _PGA2CON_SELPI0_MASK                     0x00000800
#define _PGA2CON_SELPI0_LENGTH                   0x00000001

#define _PGA2CON_SELPI1_POSITION                 0x0000000C
#define _PGA2CON_SELPI1_MASK                     0x00001000
#define _PGA2CON_SELPI1_LENGTH                   0x00000001

