Ryan-Rogers/MMSoftware/MM_2015.X/support/dspic33e/h/p33EP32GS202.h
#define _IPC43_I2C1BCIP0_POSITION                0x00000004
#define _IPC43_I2C1BCIP0_MASK                    0x00000010
#define _IPC43_I2C1BCIP0_LENGTH                  0x00000001

#define _IPC43_I2C1BCIP1_POSITION                0x00000005
#define _IPC43_I2C1BCIP1_MASK                    0x00000020
#define _IPC43_I2C1BCIP1_LENGTH                  0x00000001

#define _IPC43_I2C1BCIP2_POSITION                0x00000006
#define _IPC43_I2C1BCIP2_MASK                    0x00000040
#define _IPC43_I2C1BCIP2_LENGTH                  0x00000001

#define _IPC44_ADCFLTIP_POSITION                 0x00000000
#define _IPC44_ADCFLTIP_MASK                     0x00000007
#define _IPC44_ADCFLTIP_LENGTH                   0x00000003

#define _IPC44_ADCMP1IP_POSITION                 0x00000004
#define _IPC44_ADCMP1IP_MASK                     0x00000070
#define _IPC44_ADCMP1IP_LENGTH                   0x00000003

#define _IPC44_ADCMP2IP_POSITION                 0x00000008
#define _IPC44_ADCMP2IP_MASK                     0x00000700
#define _IPC44_ADCMP2IP_LENGTH                   0x00000003

#define _IPC44_ADCFLTR1IP_POSITION               0x0000000C
#define _IPC44_ADCFLTR1IP_MASK                   0x00007000
#define _IPC44_ADCFLTR1IP_LENGTH                 0x00000003

#define _IPC44_ADCFLTIP0_POSITION                0x00000000
#define _IPC44_ADCFLTIP0_MASK                    0x00000001
#define _IPC44_ADCFLTIP0_LENGTH                  0x00000001

#define _IPC44_ADCFLTIP1_POSITION                0x00000001
#define _IPC44_ADCFLTIP1_MASK                    0x00000002
#define _IPC44_ADCFLTIP1_LENGTH                  0x00000001

#define _IPC44_ADCFLTIP2_POSITION                0x00000002
#define _IPC44_ADCFLTIP2_MASK                    0x00000004
#define _IPC44_ADCFLTIP2_LENGTH                  0x00000001

#define _IPC44_ADCMP1IP0_POSITION                0x00000004
#define _IPC44_ADCMP1IP0_MASK                    0x00000010
#define _IPC44_ADCMP1IP0_LENGTH                  0x00000001

#define _IPC44_ADCMP1IP1_POSITION                0x00000005
#define _IPC44_ADCMP1IP1_MASK                    0x00000020
#define _IPC44_ADCMP1IP1_LENGTH                  0x00000001

#define _IPC44_ADCMP1IP2_POSITION                0x00000006
#define _IPC44_ADCMP1IP2_MASK                    0x00000040
#define _IPC44_ADCMP1IP2_LENGTH                  0x00000001

#define _IPC44_ADCMP2IP0_POSITION                0x00000008
#define _IPC44_ADCMP2IP0_MASK                    0x00000100
#define _IPC44_ADCMP2IP0_LENGTH                  0x00000001

#define _IPC44_ADCMP2IP1_POSITION                0x00000009
#define _IPC44_ADCMP2IP1_MASK                    0x00000200
#define _IPC44_ADCMP2IP1_LENGTH                  0x00000001

#define _IPC44_ADCMP2IP2_POSITION                0x0000000A
#define _IPC44_ADCMP2IP2_MASK                    0x00000400
#define _IPC44_ADCMP2IP2_LENGTH                  0x00000001

#define _IPC44_ADCFLTR1IP0_POSITION              0x0000000C
#define _IPC44_ADCFLTR1IP0_MASK                  0x00001000
#define _IPC44_ADCFLTR1IP0_LENGTH                0x00000001

#define _IPC44_ADCFLTR1IP1_POSITION              0x0000000D
#define _IPC44_ADCFLTR1IP1_MASK                  0x00002000
#define _IPC44_ADCFLTR1IP1_LENGTH                0x00000001

#define _IPC44_ADCFLTR1IP2_POSITION              0x0000000E
#define _IPC44_ADCFLTR1IP2_MASK                  0x00004000
#define _IPC44_ADCFLTR1IP2_LENGTH                0x00000001

#define _IPC46_ADCC0EIP_POSITION                 0x0000000C
#define _IPC46_ADCC0EIP_MASK                     0x00007000
#define _IPC46_ADCC0EIP_LENGTH                   0x00000003

#define _IPC46_ADCC0EIP0_POSITION                0x0000000C
#define _IPC46_ADCC0EIP0_MASK                    0x00001000
#define _IPC46_ADCC0EIP0_LENGTH                  0x00000001

#define _IPC46_ADCC0EIP1_POSITION                0x0000000D
#define _IPC46_ADCC0EIP1_MASK                    0x00002000
#define _IPC46_ADCC0EIP1_LENGTH                  0x00000001

#define _IPC46_ADCC0EIP2_POSITION                0x0000000E
#define _IPC46_ADCC0EIP2_MASK                    0x00004000
#define _IPC46_ADCC0EIP2_LENGTH                  0x00000001

#define _IPC47_ADCC1EIP_POSITION                 0x00000000
#define _IPC47_ADCC1EIP_MASK                     0x00000007
#define _IPC47_ADCC1EIP_LENGTH                   0x00000003

#define _IPC47_ADCC1EIP0_POSITION                0x00000000
#define _IPC47_ADCC1EIP0_MASK                    0x00000001
#define _IPC47_ADCC1EIP0_LENGTH                  0x00000001

#define _IPC47_ADCC1EIP1_POSITION                0x00000001
#define _IPC47_ADCC1EIP1_MASK                    0x00000002
#define _IPC47_ADCC1EIP1_LENGTH                  0x00000001

#define _IPC47_ADCC1EIP2_POSITION                0x00000002
#define _IPC47_ADCC1EIP2_MASK                    0x00000004
#define _IPC47_ADCC1EIP2_LENGTH                  0x00000001

#define _INTCON1_OSCFAIL_POSITION                0x00000001
#define _INTCON1_OSCFAIL_MASK                    0x00000002
#define _INTCON1_OSCFAIL_LENGTH                  0x00000001

#define _INTCON1_STKERR_POSITION                 0x00000002
#define _INTCON1_STKERR_MASK                     0x00000004
#define _INTCON1_STKERR_LENGTH                   0x00000001

#define _INTCON1_ADDRERR_POSITION                0x00000003
#define _INTCON1_ADDRERR_MASK                    0x00000008
#define _INTCON1_ADDRERR_LENGTH                  0x00000001

#define _INTCON1_MATHERR_POSITION                0x00000004
#define _INTCON1_MATHERR_MASK                    0x00000010
#define _INTCON1_MATHERR_LENGTH                  0x00000001

#define _INTCON1_DIV0ERR_POSITION                0x00000006
#define _INTCON1_DIV0ERR_MASK                    0x00000040
#define _INTCON1_DIV0ERR_LENGTH                  0x00000001

#define _INTCON1_SFTACERR_POSITION               0x00000007
#define _INTCON1_SFTACERR_MASK                   0x00000080
#define _INTCON1_SFTACERR_LENGTH                 0x00000001

#define _INTCON1_COVTE_POSITION                  0x00000008
#define _INTCON1_COVTE_MASK                      0x00000100
#define _INTCON1_COVTE_LENGTH                    0x00000001

#define _INTCON1_OVBTE_POSITION                  0x00000009
#define _INTCON1_OVBTE_MASK                      0x00000200
#define _INTCON1_OVBTE_LENGTH                    0x00000001

#define _INTCON1_OVATE_POSITION                  0x0000000A
#define _INTCON1_OVATE_MASK                      0x00000400
#define _INTCON1_OVATE_LENGTH                    0x00000001

